{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\chasi_000\Dropbox\Apps\ShareLaTeX\Donde\log\Boosting20 Apr 2017.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}20 Apr 2017, 18:14:24
{txt}
{com}. ********************************************************************************
. 
. * a plugin has to be explicitly loaded (unlike an ado file)
. * "capture" means that if it's loaded already this line won't give an error
. 
. *Directory for .\boost64.dll 
. cd $computer_path
{res}C:\Users\chasi_000\Dropbox\Apps\ShareLaTeX\Donde
{txt}
{com}. *cd D:\WKDir-Stata
. capture program drop boost_plugin
{txt}
{com}. program boost_plugin, plugin using("${c -(}computer_path{c )-}\boost64.dll")
{txt}
{com}. 
. set more off
{txt}
{com}. set seed 12345678
{txt}
{com}. 
. ********************************************************************************
. *Dependent variable
. global dep_var pago_frec_voluntario
{txt}
{com}. *Independent variable (not factor variables)
. global ind_var mujer mas_prepa  pb fb tentado pr_recup  prenda_tipo_cd_1 prenda_tipo_cd_2  pres_antes cta_tanda fam_comun t_llegar 
{txt}
{com}. *Independent variables (factor variables)
. global ind_var_factor suc week razon edo_civil plan_gasto tempt
{txt}
{com}. *Train fraction
. global trainf=0.75
{txt}
{com}. *Directory for plots
. global plot $computer_path\Figuras\Boost
{txt}
{com}. *Activate profiler (=1)
. global profiler=1
{txt}
{com}. ********************************************************************************
. 
. 
.         
. ********************************************************************************
. *Data preparation               
. 
. use "${c -(}computer_path{c )-}/DB/Master.dta", clear
{txt}
{com}. 
. *Frequent voluntary payment        
. gen pago_frec_voluntario=(prod_7_5+prod_7_7)
{txt}
{com}. *Education
. gen mas_prepa=(educacion>=4)
{txt}
{com}. 
. 
. ********************************************************************************
. 
. ********************************************************************************
. *Generate dummies for dependent factor variables
. foreach factorv in $ind_var_factor {c -(}
{txt}  2{com}.         qui tabulate `factorv', gen(D_`factorv')
{txt}  3{com}.         {c )-}
{txt}
{com}. 
. 
. *Drop missing values
. foreach var of varlist $ind_var D_*     {c -(}
{txt}  2{com}.         drop if missing(`var')
{txt}  3{com}.         {c )-}
{txt}(5715 observations deleted)
(0 observations deleted)
(1884 observations deleted)
(0 observations deleted)
(43 observations deleted)
(720 observations deleted)
(40 observations deleted)
(0 observations deleted)
(996 observations deleted)
(22 observations deleted)
(55 observations deleted)
(42 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(25 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(32 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)
(17 observations deleted)
(0 observations deleted)
(0 observations deleted)
(2 observations deleted)
(0 observations deleted)
(0 observations deleted)
(0 observations deleted)

{com}.         
. *Randomize order of data set
. gen u=uniform()
{txt}
{com}. sort u
{txt}
{com}. forvalues i=1/2 {c -(}
{txt}  2{com}.         replace u=uniform()
{txt}  3{com}.         sort u
{txt}  4{com}.         {c )-}
{txt}(3788 real changes made)
(3788 real changes made)

{com}. qui count
{txt}
{com}. global trainn= round($trainf *`r(N)'+1) 
{txt}
{com}. 
. *All variables must vary
. foreach var of varlist D_* {c -(}
{txt}  2{com}.         qui su `var'
{txt}  3{com}.         if `r(min)'==`r(max)' {c -(}
{txt}  4{com}.                 drop `var'
{txt}  5{com}.                 {c )-}
{txt}  6{com}.         {c )-}       
{txt}
{com}. 
. ********************************************************************************
. *Summary statistics for independent variables
. 
. su $ind_var

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}mujer {c |}{res}      3788    .7241288    .4470112          0          1
{txt}{space 3}mas_prepa {c |}{res}      3788    .3674762    .4821813          0          1
{txt}{space 10}pb {c |}{res}      3788    .1594509    .3661444          0          1
{txt}{space 10}fb {c |}{res}      3788    .0884372    .2839671          0          1
{txt}{space 5}tentado {c |}{res}      3788    .6998416    .4583872          0          1
{txt}{hline 13}{c +}{hline 56}
{space 4}pr_recup {c |}{res}      3788    92.12434    16.36322          0        100
{txt}prenda_tip~1 {c |}{res}      3788    .0760296    .2650804          0          1
{txt}prenda_tip~2 {c |}{res}      3788    .3220697    .4673312          0          1
{txt}{space 2}pres_antes {c |}{res}      3788    .8798838    .3251402          0          1
{txt}{space 3}cta_tanda {c |}{res}      3788    .3936114    .4886149          0          1
{txt}{hline 13}{c +}{hline 56}
{space 3}fam_comun {c |}{res}      3788    .3165259    .4651821          0          1
{txt}{space 4}t_llegar {c |}{res}      3788    22.27006    21.56835          0        250
{txt}
{com}. 
. foreach var of varlist $ind_var_factor {c -(}
{txt}  2{com}.         tab `var'
{txt}  3{com}.         {c )-}

   {txt}Sucursal {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
Insurgentes {c |}{res}        589       15.55       15.55
{txt}  San Cosme {c |}{res}        517       13.65       29.20
{txt}         42 {c |}{res}        700       18.48       47.68
{txt}         78 {c |}{res}        841       22.20       69.88
{txt}         80 {c |}{res}        678       17.90       87.78
{txt}        104 {c |}{res}        463       12.22      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,788      100.00

 {txt}Días de la {c |}
     Semana {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
     Monday {c |}{res}        636       16.79       16.79
{txt}    Tuesday {c |}{res}        636       16.79       33.58
{txt}  Wednesday {c |}{res}        640       16.90       50.48
{txt}   Thursday {c |}{res}        674       17.79       68.27
{txt}     Friday {c |}{res}        668       17.63       85.90
{txt}   Saturday {c |}{res}        534       14.10      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,788      100.00

  {txt}Razón principal para empeñar {c |}      Freq.     Percent        Cum.
{hline 31}{c +}{hline 35}
Perdió un empleo en la familia {c |}{res}        184        4.86        4.86
{txt}        Atender una enfermedad {c |}{res}        426       11.25       16.10
{txt}              Un gasto urgente {c |}{res}      2,674       70.59       86.69
{txt}           Un gasto NO urgente {c |}{res}        504       13.31      100.00
{txt}{hline 31}{c +}{hline 35}
                         Total {c |}{res}      3,788      100.00

     {txt}Estado {c |}
      Civil {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
     Casado {c |}{res}      2,106       55.60       55.60
{txt}    Soltero {c |}{res}      1,215       32.07       87.67
{txt} Divorciado {c |}{res}        247        6.52       94.19
{txt}      Viudo {c |}{res}        220        5.81      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,788      100.00

   {txt}Planea su {c |}
 presupuesto {c |}
   de gastos {c |}
     del mes {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
          No {c |}{res}        852       22.49       22.49
{txt}Casi Siempre {c |}{res}        661       17.45       39.94
{txt}          Sí {c |}{res}      2,275       60.06      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}      3,788      100.00

  {txt}Gasta más {c |}
  de lo que {c |}
   quisiera {c |}
        por {c |}
  tentación {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      Nunca {c |}{res}        597       15.76       15.76
{txt} Casi Nunca {c |}{res}        622       16.42       32.18
{txt}    A veces {c |}{res}      2,122       56.02       88.20
{txt}Muy Seguido {c |}{res}        447       11.80      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,788      100.00
{txt}
{com}. 
. 
. *Summary statistics for independent variables IN SAMPLE
. 
. qui reg $dep_var $ind_var D_* in 1/$trainn
{txt}
{com}. 
. su $ind_var if e(sample)

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 7}mujer {c |}{res}      2842    .7241379    .4470263          0          1
{txt}{space 3}mas_prepa {c |}{res}      2842    .3705137    .4830273          0          1
{txt}{space 10}pb {c |}{res}      2842    .1622097     .368708          0          1
{txt}{space 10}fb {c |}{res}      2842    .0900774     .286343          0          1
{txt}{space 5}tentado {c |}{res}      2842    .6949331    .4605168          0          1
{txt}{hline 13}{c +}{hline 56}
{space 4}pr_recup {c |}{res}      2842    91.97818    16.64363          0        100
{txt}prenda_tip~1 {c |}{res}      2842    .0816327    .2738524          0          1
{txt}prenda_tip~2 {c |}{res}      2842     .320197    .4666342          0          1
{txt}{space 2}pres_antes {c |}{res}      2842    .8779029    .3274556          0          1
{txt}{space 3}cta_tanda {c |}{res}      2842    .3895144     .487726          0          1
{txt}{hline 13}{c +}{hline 56}
{space 3}fam_comun {c |}{res}      2842    .3191414     .466226          0          1
{txt}{space 4}t_llegar {c |}{res}      2842    22.34166    21.83492          0        250
{txt}
{com}. 
. foreach var of varlist $ind_var_factor {c -(}
{txt}  2{com}.         tab `var' if e(sample)
{txt}  3{com}.         {c )-}

   {txt}Sucursal {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
Insurgentes {c |}{res}        440       15.48       15.48
{txt}  San Cosme {c |}{res}        386       13.58       29.06
{txt}         42 {c |}{res}        521       18.33       47.40
{txt}         78 {c |}{res}        647       22.77       70.16
{txt}         80 {c |}{res}        490       17.24       87.40
{txt}        104 {c |}{res}        358       12.60      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,842      100.00

 {txt}Días de la {c |}
     Semana {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
     Monday {c |}{res}        480       16.89       16.89
{txt}    Tuesday {c |}{res}        462       16.26       33.15
{txt}  Wednesday {c |}{res}        472       16.61       49.75
{txt}   Thursday {c |}{res}        513       18.05       67.80
{txt}     Friday {c |}{res}        515       18.12       85.93
{txt}   Saturday {c |}{res}        400       14.07      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,842      100.00

  {txt}Razón principal para empeñar {c |}      Freq.     Percent        Cum.
{hline 31}{c +}{hline 35}
Perdió un empleo en la familia {c |}{res}        146        5.14        5.14
{txt}        Atender una enfermedad {c |}{res}        318       11.19       16.33
{txt}              Un gasto urgente {c |}{res}      2,003       70.48       86.81
{txt}           Un gasto NO urgente {c |}{res}        375       13.19      100.00
{txt}{hline 31}{c +}{hline 35}
                         Total {c |}{res}      2,842      100.00

     {txt}Estado {c |}
      Civil {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
     Casado {c |}{res}      1,566       55.10       55.10
{txt}    Soltero {c |}{res}        939       33.04       88.14
{txt} Divorciado {c |}{res}        170        5.98       94.12
{txt}      Viudo {c |}{res}        167        5.88      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,842      100.00

   {txt}Planea su {c |}
 presupuesto {c |}
   de gastos {c |}
     del mes {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
          No {c |}{res}        654       23.01       23.01
{txt}Casi Siempre {c |}{res}        468       16.47       39.48
{txt}          Sí {c |}{res}      1,720       60.52      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}      2,842      100.00

  {txt}Gasta más {c |}
  de lo que {c |}
   quisiera {c |}
        por {c |}
  tentación {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
      Nunca {c |}{res}        442       15.55       15.55
{txt} Casi Nunca {c |}{res}        488       17.17       32.72
{txt}    A veces {c |}{res}      1,585       55.77       88.49
{txt}Muy Seguido {c |}{res}        327       11.51      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,842      100.00
{txt}
{com}.         
. ********************************************************************************
. *Logistic Regression
. 
. capture drop logit_pred logit_pred2
{txt}
{com}. capture profiler clear 
{txt}
{com}. profiler on
{txt}
{com}. logistic $dep_var $ind_var D_* in 1/$trainn
{txt}note: D_suc6 omitted because of collinearity
note: D_week6 omitted because of collinearity
note: D_razon4 omitted because of collinearity
note: D_edo_civil4 omitted because of collinearity
note: D_plan_gasto3 omitted because of collinearity
note: D_tempt4 omitted because of collinearity
{res}
{txt}Logistic regression{col 51}Number of obs{col 67}= {res}      2842
{txt}{col 51}LR chi2({res}33{txt}){col 67}= {res}    181.64
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-873.69531{txt}{col 51}Pseudo R2{col 67}= {res}    0.0942

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pago_frec_voluntario{col 22}{c |} Odds Ratio{col 34}   Std. Err.{col 46}      z{col 54}   P>|z|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}mujer {c |}{col 22}{res}{space 2} 1.173645{col 34}{space 2}  .174779{col 45}{space 1}    1.08{col 54}{space 3}0.282{col 62}{space 4}  .876549{col 75}{space 3} 1.571439
{txt}{space 11}mas_prepa {c |}{col 22}{res}{space 2} .9259718{col 34}{space 2} .1236713{col 45}{space 1}   -0.58{col 54}{space 3}0.565{col 62}{space 4} .7127097{col 75}{space 3} 1.203048
{txt}{space 18}pb {c |}{col 22}{res}{space 2} .9459617{col 34}{space 2}  .171283{col 45}{space 1}   -0.31{col 54}{space 3}0.759{col 62}{space 4} .6633588{col 75}{space 3} 1.348959
{txt}{space 18}fb {c |}{col 22}{res}{space 2} 1.065405{col 34}{space 2} .2275142{col 45}{space 1}    0.30{col 54}{space 3}0.767{col 62}{space 4} .7010405{col 75}{space 3} 1.619147
{txt}{space 13}tentado {c |}{col 22}{res}{space 2} 1.966512{col 34}{space 2} .7948821{col 45}{space 1}    1.67{col 54}{space 3}0.094{col 62}{space 4} .8904983{col 75}{space 3} 4.342702
{txt}{space 12}pr_recup {c |}{col 22}{res}{space 2} .9967982{col 34}{space 2} .0038526{col 45}{space 1}   -0.83{col 54}{space 3}0.407{col 62}{space 4} .9892757{col 75}{space 3} 1.004378
{txt}{space 4}prenda_tipo_cd_1 {c |}{col 22}{res}{space 2} .9663241{col 34}{space 2} .2384985{col 45}{space 1}   -0.14{col 54}{space 3}0.890{col 62}{space 4} .5957139{col 75}{space 3} 1.567501
{txt}{space 4}prenda_tipo_cd_2 {c |}{col 22}{res}{space 2}    1.306{col 34}{space 2} .1784666{col 45}{space 1}    1.95{col 54}{space 3}0.051{col 62}{space 4} .9991381{col 75}{space 3} 1.707108
{txt}{space 10}pres_antes {c |}{col 22}{res}{space 2}  .816364{col 34}{space 2} .1514345{col 45}{space 1}   -1.09{col 54}{space 3}0.274{col 62}{space 4} .5675276{col 75}{space 3} 1.174304
{txt}{space 11}cta_tanda {c |}{col 22}{res}{space 2} 1.234967{col 34}{space 2} .1638435{col 45}{space 1}    1.59{col 54}{space 3}0.112{col 62}{space 4} .9521958{col 75}{space 3} 1.601713
{txt}{space 11}fam_comun {c |}{col 22}{res}{space 2}  .957033{col 34}{space 2} .1336793{col 45}{space 1}   -0.31{col 54}{space 3}0.753{col 62}{space 4} .7278305{col 75}{space 3} 1.258414
{txt}{space 12}t_llegar {c |}{col 22}{res}{space 2} .9955308{col 34}{space 2} .0033033{col 45}{space 1}   -1.35{col 54}{space 3}0.177{col 62}{space 4} .9890774{col 75}{space 3} 1.002026
{txt}{space 14}D_suc1 {c |}{col 22}{res}{space 2} .4206242{col 34}{space 2} .0883767{col 45}{space 1}   -4.12{col 54}{space 3}0.000{col 62}{space 4} .2786439{col 75}{space 3} .6349491
{txt}{space 14}D_suc2 {c |}{col 22}{res}{space 2}  .333747{col 34}{space 2} .0781891{col 45}{space 1}   -4.68{col 54}{space 3}0.000{col 62}{space 4} .2108632{col 75}{space 3} .5282431
{txt}{space 14}D_suc3 {c |}{col 22}{res}{space 2} .6784178{col 34}{space 2}  .125102{col 45}{space 1}   -2.10{col 54}{space 3}0.035{col 62}{space 4} .4726433{col 75}{space 3} .9737802
{txt}{space 14}D_suc4 {c |}{col 22}{res}{space 2} .2302055{col 34}{space 2} .0488132{col 45}{space 1}   -6.93{col 54}{space 3}0.000{col 62}{space 4} .1519236{col 75}{space 3} .3488239
{txt}{space 14}D_suc5 {c |}{col 22}{res}{space 2} .1004849{col 34}{space 2} .0299052{col 45}{space 1}   -7.72{col 54}{space 3}0.000{col 62}{space 4} .0560758{col 75}{space 3} .1800635
{txt}{space 14}D_suc6 {c |}{col 22}{res}{space 2}        1{col 34}{txt}  (omitted)
{space 13}D_week1 {c |}{col 22}{res}{space 2} .9435611{col 34}{space 2}  .192904{col 45}{space 1}   -0.28{col 54}{space 3}0.776{col 62}{space 4} .6320454{col 75}{space 3} 1.408613
{txt}{space 13}D_week2 {c |}{col 22}{res}{space 2} .8556063{col 34}{space 2} .1785191{col 45}{space 1}   -0.75{col 54}{space 3}0.455{col 62}{space 4} .5684259{col 75}{space 3} 1.287876
{txt}{space 13}D_week3 {c |}{col 22}{res}{space 2} .3870928{col 34}{space 2} .0941201{col 45}{space 1}   -3.90{col 54}{space 3}0.000{col 62}{space 4} .2403526{col 75}{space 3} .6234211
{txt}{space 13}D_week4 {c |}{col 22}{res}{space 2} .5242519{col 34}{space 2} .1172695{col 45}{space 1}   -2.89{col 54}{space 3}0.004{col 62}{space 4} .3381703{col 75}{space 3} .8127269
{txt}{space 13}D_week5 {c |}{col 22}{res}{space 2} .4091402{col 34}{space 2}  .096013{col 45}{space 1}   -3.81{col 54}{space 3}0.000{col 62}{space 4} .2582977{col 75}{space 3} .6480728
{txt}{space 13}D_week6 {c |}{col 22}{res}{space 2}        1{col 34}{txt}  (omitted)
{space 12}D_razon1 {c |}{col 22}{res}{space 2} .9097491{col 34}{space 2} .2867121{col 45}{space 1}   -0.30{col 54}{space 3}0.764{col 62}{space 4}  .490525{col 75}{space 3}  1.68726
{txt}{space 12}D_razon2 {c |}{col 22}{res}{space 2} .6695237{col 34}{space 2} .1804217{col 45}{space 1}   -1.49{col 54}{space 3}0.137{col 62}{space 4} .3948083{col 75}{space 3} 1.135392
{txt}{space 12}D_razon3 {c |}{col 22}{res}{space 2} .9439619{col 34}{space 2} .1734728{col 45}{space 1}   -0.31{col 54}{space 3}0.754{col 62}{space 4} .6584584{col 75}{space 3} 1.353258
{txt}{space 12}D_razon4 {c |}{col 22}{res}{space 2}        1{col 34}{txt}  (omitted)
{space 8}D_edo_civil1 {c |}{col 22}{res}{space 2} .7981183{col 34}{space 2}  .220977{col 45}{space 1}   -0.81{col 54}{space 3}0.415{col 62}{space 4} .4638665{col 75}{space 3} 1.373225
{txt}{space 8}D_edo_civil2 {c |}{col 22}{res}{space 2} 1.030973{col 34}{space 2} .2916275{col 45}{space 1}    0.11{col 54}{space 3}0.914{col 62}{space 4} .5922033{col 75}{space 3}  1.79483
{txt}{space 8}D_edo_civil3 {c |}{col 22}{res}{space 2} 1.102691{col 34}{space 2} .3882708{col 45}{space 1}    0.28{col 54}{space 3}0.781{col 62}{space 4} .5530132{col 75}{space 3} 2.198731
{txt}{space 8}D_edo_civil4 {c |}{col 22}{res}{space 2}        1{col 34}{txt}  (omitted)
{space 7}D_plan_gasto1 {c |}{col 22}{res}{space 2} .7931692{col 34}{space 2} .1313596{col 45}{space 1}   -1.40{col 54}{space 3}0.162{col 62}{space 4} .5733176{col 75}{space 3} 1.097328
{txt}{space 7}D_plan_gasto2 {c |}{col 22}{res}{space 2} .7199594{col 34}{space 2} .1381861{col 45}{space 1}   -1.71{col 54}{space 3}0.087{col 62}{space 4} .4942331{col 75}{space 3} 1.048779
{txt}{space 7}D_plan_gasto3 {c |}{col 22}{res}{space 2}        1{col 34}{txt}  (omitted)
{space 12}D_tempt1 {c |}{col 22}{res}{space 2} 2.062062{col 34}{space 2}  .920691{col 45}{space 1}    1.62{col 54}{space 3}0.105{col 62}{space 4} .8595052{col 75}{space 3}  4.94715
{txt}{space 12}D_tempt2 {c |}{col 22}{res}{space 2} 1.601609{col 34}{space 2} .7224485{col 45}{space 1}    1.04{col 54}{space 3}0.296{col 62}{space 4} .6616058{col 75}{space 3} 3.877159
{txt}{space 12}D_tempt3 {c |}{col 22}{res}{space 2} .9595532{col 34}{space 2} .2043822{col 45}{space 1}   -0.19{col 54}{space 3}0.846{col 62}{space 4} .6320705{col 75}{space 3} 1.456708
{txt}{space 12}D_tempt4 {c |}{col 22}{res}{space 2}        1{col 34}{txt}  (omitted)
{space 15}_cons {c |}{col 22}{res}{space 2} .4262047{col 34}{space 2} .3014257{col 45}{space 1}   -1.21{col 54}{space 3}0.228{col 62}{space 4} .1065665{col 75}{space 3} 1.704573
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. profiler off
{txt}
{com}. if $profiler ==1 {c -(} 
.         profiler report 
{txt}logistic
{res}     1    0.003{txt}  logistic
{res}     1    0.014{txt}  Estimate
{res}     1    0.000{txt}  Display
{res}          0.017{txt}  Total
_vce_parserun
{res}     2    0.001{txt}  _vce_parserun
{res}     2    0.000{txt}  MYRESULT
{res}          0.001{txt}  Total
_on_colon_parse
{res}     6    0.001{txt}  _on_colon_parse
_get_diopts
{res}    11    0.008{txt}  _get_diopts
{res}    11    0.000{txt}  Wrapon
{res}          0.008{txt}  Total
opts_exclusive
{res}   143    0.002{txt}  opts_exclusive
logit
{res}     2    0.002{txt}  logit
{res}     1    0.094{txt}  Estimate
{res}     2    0.002{txt}  Replay
{res}          0.098{txt}  Total
mlopts
{res}     1    0.000{txt}  mlopts
ml
{res}     1    0.004{txt}  ml
mopt
{res}     1    0.002{txt}  mopt
{res}     1    0.560{txt}  Model
{res}     2    0.004{txt}  Clear
{res}     1    0.685{txt}  MaxMin
{res}     1    0.000{txt}  ChkMacros
{res}          1.251{txt}  Total
_get_diparmopts
{res}     2    0.000{txt}  _get_diparmopts
{res}     2    0.001{txt}  SpliceGlobals
{res}          0.001{txt}  Total
_eqlist
{res}     1    0.000{txt}  new
{res}     2    0.001{txt}  _init
{res}     1    0.000{txt}  _setup
{res}     1    0.003{txt}  parse
{res}    10    0.001{txt}  eq
{res}     1    0.001{txt}  dim
{res}          0.006{txt}  Total
_optlist
{res}     4    0.000{txt}  reset
{res}     3    0.000{txt}  addopt
{res}     7    0.001{txt}  dumpoptions
{res}     4    0.000{txt}  dumpnames
{res}          0.001{txt}  Total
_eqspec
{res}     1    0.000{txt}  new
{res}     1    0.003{txt}  parse
{res}     1    0.000{txt}  _confirm_eqname
{res}     8    0.000{txt}  item
{res}     8    0.001{txt}  _check_eq_item_name
{res}          0.004{txt}  Total
tsunab
{res}     1    0.000{txt}  tsunab
fvunab
{res}     1    0.002{txt}  fvunab
_mkvec
{res}     1    0.000{txt}  _mkvec
{res}     1    0.000{txt}  From
{res}     1    0.000{txt}  BuildMat
{res}     1    0.000{txt}  ChkMat
{res}     1    0.018{txt}  ChkNames
{res}          0.018{txt}  Total
_b_post0
{res}     1    0.010{txt}  _b_post0
makecns
{res}     1    0.000{txt}  makecns
mopt_post
{res}     1    0.029{txt}  mopt_post
_prefix_display
{res}     2    0.010{txt}  _prefix_display
{res}     6    0.000{txt}  Chk4PosInt
{res}          0.010{txt}  Total
is_svysum
{res}     3    0.000{txt}  is_svysum
_check_eformopt
{res}     2    0.001{txt}  _check_eformopt
_get_eformopts
{res}     3    0.009{txt}  _get_eformopts
_coef_table_header
{res}     1    0.001{txt}  _coef_table_header
{res}     1    0.000{txt}  Chi2test
{res}     1    0.003{txt}  Display
{res}          0.004{txt}  Total
_prefix_legend
{res}     1    0.015{txt}  _prefix_legend
{res}     2    0.003{txt}  ListElementSizes
{res}          0.018{txt}  Total
_coef_table
{res}     1    0.091{txt}  _coef_table
_get_mcompare
{res}     1    0.001{txt}  _get_mcompare
_prefix_footnote
{res}     1    0.001{txt}  _prefix_footnote
{res}     1    0.000{txt}  CompleteLogit
{res}          0.001{txt}  Total
ml_footnote
{res}     1    0.001{txt}  ml_footnote
_check_e_rc
{res}     2    0.000{txt}  _check_e_rc
Overall total count = {res}   287
{txt}Overall total time  = {res}     1.589{txt} (sec)
{com}.         {c )-}  
{txt}
{com}. 
. predict logit_pred 
{txt}(option pr assumed; Pr(pago_frec_voluntario))

{com}. gen logit_pred2=round( logit_pred)  
{txt}
{com}. 
. ********************************************************************************
. 
. ********************************************************************************
. *Stepwise Logistic Regression
. 
. capture drop swlogit_pred swlogit_pred2
{txt}
{com}. capture profiler clear 
{txt}
{com}. profiler on
{txt}
{com}. sw logistic  $dep_var $ind_var $ind_var_factor  in 1/$trainn , pr(0.15)  
{txt}                      begin with full model
p = {res}0.9275{txt} >= 0.1500  removing {res}prenda_tipo_cd_1
{txt}p = {res}0.8324{txt} >= 0.1500  removing {res}pr_recup
{txt}p = {res}0.8016{txt} >= 0.1500  removing {res}fam_comun
{txt}p = {res}0.6756{txt} >= 0.1500  removing {res}mujer
{txt}p = {res}0.5345{txt} >= 0.1500  removing {res}pb
{txt}p = {res}0.4953{txt} >= 0.1500  removing {res}suc
{txt}p = {res}0.4353{txt} >= 0.1500  removing {res}mas_prepa
{txt}p = {res}0.3756{txt} >= 0.1500  removing {res}razon
{txt}p = {res}0.3684{txt} >= 0.1500  removing {res}fb
{txt}p = {res}0.2297{txt} >= 0.1500  removing {res}tempt
{txt}p = {res}0.6881{txt} >= 0.1500  removing {res}tentado

{txt}Logistic regression{col 51}Number of obs{col 67}= {res}      2842
{txt}{col 51}LR chi2({res}7{txt}){col 67}= {res}     28.09
{txt}{col 51}Prob > chi2{col 67}= {res}    0.0002
{txt}Log likelihood = {res}-950.47108{txt}{col 51}Pseudo R2{col 67}= {res}    0.0146

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pago_frec_voluntario{col 22}{c |} Odds Ratio{col 34}   Std. Err.{col 46}      z{col 54}   P>|z|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}edo_civil {c |}{col 22}{res}{space 2} 1.164874{col 34}{space 2} .0807807{col 45}{space 1}    2.20{col 54}{space 3}0.028{col 62}{space 4} 1.016835{col 75}{space 3} 1.334465
{txt}{space 12}t_llegar {c |}{col 22}{res}{space 2} .9950042{col 34}{space 2} .0031742{col 45}{space 1}   -1.57{col 54}{space 3}0.116{col 62}{space 4} .9888024{col 75}{space 3} 1.001245
{txt}{space 16}week {c |}{col 22}{res}{space 2} .9302113{col 34}{space 2} .0340338{col 45}{space 1}   -1.98{col 54}{space 3}0.048{col 62}{space 4} .8658418{col 75}{space 3} .9993663
{txt}{space 11}cta_tanda {c |}{col 22}{res}{space 2} 1.289769{col 34}{space 2} .1602375{col 45}{space 1}    2.05{col 54}{space 3}0.041{col 62}{space 4} 1.011023{col 75}{space 3} 1.645368
{txt}{space 4}prenda_tipo_cd_2 {c |}{col 22}{res}{space 2}   1.3655{col 34}{space 2} .1726402{col 45}{space 1}    2.46{col 54}{space 3}0.014{col 62}{space 4} 1.065796{col 75}{space 3}  1.74948
{txt}{space 10}plan_gasto {c |}{col 22}{res}{space 2} 1.161533{col 34}{space 2} .0896349{col 45}{space 1}    1.94{col 54}{space 3}0.052{col 62}{space 4} .9984926{col 75}{space 3} 1.351196
{txt}{space 10}pres_antes {c |}{col 22}{res}{space 2} .7670805{col 34}{space 2} .1338393{col 45}{space 1}   -1.52{col 54}{space 3}0.129{col 62}{space 4} .5449094{col 75}{space 3} 1.079836
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} .1259807{col 34}{space 2} .0323631{col 45}{space 1}   -8.06{col 54}{space 3}0.000{col 62}{space 4} .0761447{col 75}{space 3}  .208434
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. profiler off
{txt}
{com}. if $profiler ==1 {c -(} 
.         profiler report 
{txt}sw
{res}     1    0.006{txt}  sw
stepwise
{res}     1    0.025{txt}  stepwise
ssd
{res}     1    0.000{txt}  ssd
{res}     1    0.000{txt}  ssd_query
{res}          0.000{txt}  Total
_on_colon_parse
{res}    67    0.022{txt}  _on_colon_parse
sw_8
{res}     1    0.000{txt}  sw_8
{res}     2    0.000{txt}  RmGlobal
{res}     1    0.005{txt}  DoEst
{res}     1    0.000{txt}  SetCmd
{res}     1    0.000{txt}  logis_sw
{res}    19    0.002{txt}  IfEndTrm
{res}     1    0.000{txt}  CmdOpts
{res}     1    0.001{txt}  SetVandS
{res}     1    0.021{txt}  FixColl
{res}     1    0.017{txt}  CheckEst
{res}     1    0.002{txt}  chkcons
{res}     1    0.001{txt}  DoBSel
{res}     1    0.001{txt}  FullMdl
{res}    12    0.043{txt}  RmTreg
{res}    11    0.000{txt}  tswap
{res}    11    0.004{txt}  MakeList
{res}          0.097{txt}  Total
unabbrev
{res}    19    0.000{txt}  unabbrev
logit
{res}    14    0.008{txt}  logit
{res}    13    0.243{txt}  Estimate
{res}    14    0.002{txt}  Replay
{res}          0.253{txt}  Total
_vce_parserun
{res}    14    0.001{txt}  _vce_parserun
{res}    14    0.000{txt}  MYRESULT
{res}          0.001{txt}  Total
_get_diopts
{res}    83    0.035{txt}  _get_diopts
{res}    83    0.005{txt}  Wrapon
{res}          0.040{txt}  Total
opts_exclusive
{res}  1127    0.036{txt}  opts_exclusive
mlopts
{res}    13    0.014{txt}  mlopts
ml
{res}    13    0.001{txt}  ml
mopt
{res}    13    0.004{txt}  mopt
{res}    13    0.200{txt}  Model
{res}    26    0.013{txt}  Clear
{res}    13    0.210{txt}  MaxMin
{res}    13    0.001{txt}  ChkMacros
{res}          0.428{txt}  Total
_get_diparmopts
{res}    26    0.005{txt}  _get_diparmopts
{res}    26    0.003{txt}  SpliceGlobals
{res}          0.008{txt}  Total
_eqlist
{res}    13    0.000{txt}  new
{res}    26    0.001{txt}  _init
{res}    13    0.010{txt}  _setup
{res}    13    0.033{txt}  parse
{res}   130    0.006{txt}  eq
{res}    13    0.003{txt}  dim
{res}          0.053{txt}  Total
_optlist
{res}    52    0.001{txt}  reset
{res}    39    0.004{txt}  addopt
{res}    91    0.009{txt}  dumpoptions
{res}    52    0.002{txt}  dumpnames
{res}          0.016{txt}  Total
_eqspec
{res}    13    0.000{txt}  new
{res}    13    0.013{txt}  parse
{res}    13    0.001{txt}  _confirm_eqname
{res}   104    0.002{txt}  item
{res}   104    0.013{txt}  _check_eq_item_name
{res}          0.029{txt}  Total
tsunab
{res}    13    0.002{txt}  tsunab
fvunab
{res}    13    0.003{txt}  fvunab
_mkvec
{res}    13    0.004{txt}  _mkvec
{res}    13    0.000{txt}  From
{res}    13    0.002{txt}  BuildMat
{res}    13    0.002{txt}  ChkMat
{res}    13    0.066{txt}  ChkNames
{res}          0.074{txt}  Total
mopt_post
{res}    13    0.143{txt}  mopt_post
_prefix_display
{res}    14    0.010{txt}  _prefix_display
{res}    42    0.000{txt}  Chk4PosInt
{res}          0.010{txt}  Total
is_svysum
{res}    15    0.001{txt}  is_svysum
_check_eformopt
{res}    14    0.001{txt}  _check_eformopt
_get_eformopts
{res}    27    0.015{txt}  _get_eformopts
_coef_table_header
{res}    13    0.001{txt}  _coef_table_header
{res}     1    0.000{txt}  Chi2test
{res}     1    0.003{txt}  Display
{res}          0.004{txt}  Total
_prefix_legend
{res}    13    0.043{txt}  _prefix_legend
{res}    26    0.007{txt}  ListElementSizes
{res}          0.050{txt}  Total
_coef_table
{res}    13    0.085{txt}  _coef_table
_get_mcompare
{res}    13    0.005{txt}  _get_mcompare
_prefix_footnote
{res}    13    0.002{txt}  _prefix_footnote
{res}    13    0.000{txt}  CompleteLogit
{res}          0.002{txt}  Total
ml_footnote
{res}    13    0.001{txt}  ml_footnote
_check_e_rc
{res}    26    0.000{txt}  _check_e_rc
test
{res}   150    0.024{txt}  test
logistic
{res}     1    0.001{txt}  logistic
{res}     1    0.001{txt}  Estimate
{res}     1    0.000{txt}  Display
{res}          0.002{txt}  Total
label
{res}     1    0.000{txt}  label
Overall total count = {res}  2878
{txt}Overall total time  = {res}     1.451{txt} (sec)
{com}.         {c )-}  
{txt}
{com}. 
. predict swlogit_pred 
{txt}(option pr assumed; Pr(pago_frec_voluntario))

{com}. gen swlogit_pred2=round(swlogit_pred)  
{txt}
{com}. 
. 
. ********************************************************************************
. 
. ********************************************************************************
. *Kernel Regression Least Squares
. 
. capture drop krls_pred krls_pred2
{txt}
{com}. capture profiler clear 
{txt}
{com}. profiler on
{txt}
{com}. krls  $dep_var $ind_var D_*  in 1/$trainn   
{res}{txt}Iteration =  1, Looloss: 874.7779  
{txt}Iteration =  2, Looloss: 873.4892  
{txt}Iteration =  3, Looloss: 871.4914  
{txt}Iteration =  4, Looloss: 868.475   
{txt}Iteration =  5, Looloss: 864.0985  
{txt}Iteration =  6, Looloss: 858.0912  
{txt}Iteration =  7, Looloss: 850.4035  
{txt}Iteration =  8, Looloss: 841.2892  
{txt}Iteration =  9, Looloss: 831.1773  
{txt}Iteration = 10, Looloss: 820.3943  
{txt}Iteration = 11, Looloss: 809.0816  
{txt}Iteration = 12, Looloss: 797.4626  
{txt}Iteration = 13, Looloss: 786.1033  
{txt}Iteration = 14, Looloss: 775.7894  
{txt}Iteration = 15, Looloss: 767.1625  
{txt}Iteration = 16, Looloss: 760.4952  
{txt}Iteration = 17, Looloss: 755.7058  
{txt}Iteration = 18, Looloss: 752.4821  
{txt}Iteration = 19, Looloss: 750.4216  
{res}
{txt}Pointwise Derivatives{txt}{space 44} Number of obs = {res}    2842 
{txt}{space 65} Lambda {space 6} = {res}   .9623 
{txt}{space 65} Tolerance {space 3} = {res}   2.842 
{txt}{space 65} Sigma {space 6}  = {res}      33 
{txt}{space 65} Eff. df {space 4}  = {res}   613.1 
{txt}{space 65} R2 {space 11}= {res}   .4947 
{txt}{space 65} Looloss {space 6}= {res}   748.4

{txt}{space  0}pago_frec_voluntario {c |}      Avg.{space 7}SE{space 8}t{space 4}P>|t|{space 8}P25{space 7}P50{space 7}P75{space 7}
{hline 21}{c +}{hline 68}
{space 14}{txt}*mujer {c |} {res}  .01772 {space 1}{res} .013007{res}    1.362{res}    0.173 {space 1} {res}-.015501 {space 1}{res} .016717 {space 1}{res} .051955 {space 1}
{space 10}{txt}*mas_prepa {c |} {res} .002281 {space 1}{res} .012014{res}    0.190{res}    0.849 {space 1} {res}-.028829 {space 1}{res} .002527 {space 1}{res}  .03761 {space 1}
{space 17}{txt}*pb {c |} {res}-.001521 {space 1}{res} .015515{res}   -0.098{res}    0.922 {space 1} {res}-.044925 {space 1}{res}-.004889 {space 1}{res} .039501 {space 1}
{space 17}{txt}*fb {c |} {res} .014708 {space 1}{res} .019977{res}    0.736{res}    0.462 {space 1} {res}-.038848 {space 1}{res} .012481 {space 1}{res} .064264 {space 1}
{space 12}{txt}*tentado {c |} {res} .024147 {space 1}{res} .018769{res}    1.287{res}    0.198 {space 1} {res}-.000494 {space 1}{res} .021537 {space 1}{res} .048525 {space 1}
{space 12}{txt}pr_recup {c |} {res}-.000328 {space 1}{res} .000329{res}   -0.996{res}    0.319 {space 1} {res}-.001212 {space 1}{res}-.000273 {space 1}{res} .000636 {space 1}
{space  3}{txt}*prenda_tipo_cd_1 {c |} {res}-.000811 {space 1}{res} .021112{res}   -0.038{res}    0.969 {space 1} {res}-.043436 {space 1}{res}  .00024 {space 1}{res} .047717 {space 1}
{space  3}{txt}*prenda_tipo_cd_2 {c |} {res} .009946 {space 1}{res} .012246{res}    0.812{res}    0.417 {space 1} {res} -.01773 {space 1}{res} .007508 {space 1}{res} .033173 {space 1}
{space  9}{txt}*pres_antes {c |} {res}-.013154 {space 1}{res} .018097{res}   -0.727{res}    0.467 {space 1} {res}-.055731 {space 1}{res}-.015501 {space 1}{res} .025659 {space 1}
{space 10}{txt}*cta_tanda {c |} {res} .015902 {space 1}{res} .011911{res}    1.335{res}    0.182 {space 1} {res}-.022984 {space 1}{res} .016229 {space 1}{res} .054374 {space 1}
{space 10}{txt}*fam_comun {c |} {res}-.001378 {space 1}{res}  .01252{res}   -0.110{res}    0.912 {space 1} {res} -.03589 {space 1}{res}-.002217 {space 1}{res} .030116 {space 1}
{space 12}{txt}t_llegar {c |} {res}-.000559 {space 1}{res} .000261{res}   -2.144{res}    0.032 {space 1} {res}-.001335 {space 1}{res} -.00048 {space 1}{res} .000392 {space 1}
{space 13}{txt}*D_suc1 {c |} {res} .001196 {space 1}{res} .016352{res}    0.073{res}    0.942 {space 1} {res}-.043816 {space 1}{res}-.007282 {space 1}{res} .036143 {space 1}
{space 13}{txt}*D_suc3 {c |} {res} .041568 {space 1}{res} .015911{res}    2.613{res}    0.009 {space 1} {res}-.013084 {space 1}{res} .038987 {space 1}{res}  .09903 {space 1}
{space 13}{txt}*D_suc4 {c |} {res}-.033573 {space 1}{res}  .01513{res}   -2.219{res}    0.027 {space 1} {res} -.06315 {space 1}{res} -.03017 {space 1}{res} -.00029 {space 1}
{space 13}{txt}*D_suc5 {c |} {res} -.06653 {space 1}{res} .016102{res}   -4.132{res}    0.000 {space 1} {res}-.102185 {space 1}{res}-.058688 {space 1}{res}-.025445 {space 1}
{space 13}{txt}*D_suc6 {c |} {res} .095614 {space 1}{res} .017704{res}    5.401{res}    0.000 {space 1} {res} .045386 {space 1}{res} .092929 {space 1}{res} .142942 {space 1}
{space 12}{txt}*D_week1 {c |} {res} .022191 {space 1}{res} .015759{res}    1.408{res}    0.159 {space 1} {res}-.019987 {space 1}{res} .011992 {space 1}{res} .054778 {space 1}
{space 12}{txt}*D_week2 {c |} {res}  .01529 {space 1}{res} .015928{res}    0.960{res}    0.337 {space 1} {res}-.033282 {space 1}{res}  .01445 {space 1}{res} .062436 {space 1}
{space 12}{txt}*D_week3 {c |} {res}-.050909 {space 1}{res} .016025{res}   -3.177{res}    0.002 {space 1} {res}-.084505 {space 1}{res}-.048499 {space 1}{res}-.015567 {space 1}
{space 12}{txt}*D_week4 {c |} {res}-.021804 {space 1}{res} .015526{res}   -1.404{res}    0.160 {space 1} {res}-.066053 {space 1}{res} -.02658 {space 1}{res} .016808 {space 1}
{space 12}{txt}*D_week5 {c |} {res} -.03774 {space 1}{res} .015489{res}   -2.437{res}    0.015 {space 1} {res}-.075653 {space 1}{res}-.037776 {space 1}{res} .002407 {space 1}
{space 11}{txt}*D_razon1 {c |} {res}-.007808 {space 1}{res} .023865{res}   -0.327{res}    0.744 {space 1} {res} -.05823 {space 1}{res}-.005125 {space 1}{res} .044971 {space 1}
{space 11}{txt}*D_razon3 {c |} {res} .014452 {space 1}{res} .016278{res}    0.888{res}    0.375 {space 1} {res}-.019136 {space 1}{res} .014467 {space 1}{res} .047844 {space 1}
{space 11}{txt}*D_razon4 {c |} {res} .018928 {space 1}{res} .017964{res}    1.054{res}    0.292 {space 1} {res} -.01509 {space 1}{res}  .01887 {space 1}{res} .053971 {space 1}
{space  7}{txt}*D_edo_civil1 {c |} {res}-.021797 {space 1}{res} .017574{res}   -1.240{res}    0.215 {space 1} {res}-.045293 {space 1}{res}-.020734 {space 1}{res} .005157 {space 1}
{space  7}{txt}*D_edo_civil2 {c |} {res} .008043 {space 1}{res} .017331{res}    0.464{res}    0.643 {space 1} {res}-.019948 {space 1}{res}  .00759 {space 1}{res} .037358 {space 1}
{space  7}{txt}*D_edo_civil3 {c |} {res} .000958 {space 1}{res} .022568{res}    0.042{res}    0.966 {space 1} {res}-.045275 {space 1}{res} .001922 {space 1}{res} .053356 {space 1}
{space  6}{txt}*D_plan_gasto2 {c |} {res}-.012767 {space 1}{res} .015731{res}   -0.812{res}    0.417 {space 1} {res}-.047542 {space 1}{res}-.012357 {space 1}{res} .021296 {space 1}
{space  6}{txt}*D_plan_gasto3 {c |} {res} .015103 {space 1}{res} .013282{res}    1.137{res}    0.256 {space 1} {res}-.013023 {space 1}{res} .014156 {space 1}{res} .040219 {space 1}
{space 11}{txt}*D_tempt1 {c |} {res} .030078 {space 1}{res}  .02097{res}    1.434{res}    0.152 {space 1} {res}-.000212 {space 1}{res} .027468 {space 1}{res} .055797 {space 1}
{space 11}{txt}*D_tempt2 {c |} {res} .014083 {space 1}{res} .021616{res}    0.652{res}    0.515 {space 1} {res}-.014769 {space 1}{res} .017346 {space 1}{res} .050099 {space 1}
{space 11}{txt}*D_tempt3 {c |} {res}  .00312 {space 1}{res} .015101{res}    0.207{res}    0.836 {space 1} {res}-.019751 {space 1}{res} .003528 {space 1}{res} .026736 {space 1}
{txt}{hline 21}{c +}{hline 68}
* average dy/dx is the first difference using the min and max (i.e. usually 0 to 1)

{com}. profiler off
{txt}
{com}. if $profiler ==1 {c -(} 
.         profiler report 
{txt}krls
{res}     159156.124{txt}  krls
Overall total count = {res}     1
{txt}Overall total time  = {res} 59156.124{txt} (sec)
{com}.         {c )-}  
{txt}
{com}. 
. predict krls_pred 
{res}{txt}
{com}. gen krls_pred2=round(krls_pred)  
{txt}
{com}. 
. 
. ********************************************************************************
. 
. ********************************************************************************
. 
. gen Rsquared=.
{txt}(3788 missing values generated)

{com}. gen bestiter=.
{txt}(3788 missing values generated)

{com}. gen maxiter=.
{txt}(3788 missing values generated)

{com}. gen myinter=.
{txt}(3788 missing values generated)

{com}. local i=0
{txt}
{com}. local maxiter=750
{txt}
{com}. capture profiler clear 
{txt}
{com}. profiler on
{txt}
{com}. local tempiter=`maxiter'
{txt}
{com}. foreach inter of numlist 1/6 8 10 15 20 {c -(}
{txt}  2{com}.         local i=`i'+1
{txt}  3{com}.     replace myinter= `inter' in `i'
{txt}  4{com}.         boost $dep_var $ind_var D_*, dist(logistic) train($trainf) maxiter(`tempiter') ///
>                 bag(0.5) interaction(`inter') shrink(0.1) 
{txt}  5{com}.         local maxiter=e(bestiter) 
{txt}  6{com}.         replace maxiter=`tempiter' in `i'
{txt}  7{com}.         replace bestiter=e(bestiter) in `i' 
{txt}  8{com}.         replace Rsquared=e(test_R2) in `i'
{txt}  9{com}.         * as the number of interactions increase the best number of iterations will decrease
.         * to be safe I am allowing an extra 20% of iterations and in case maxiter equals bestiter we double the number of iter
.         * when the number of interactions is large this can save a lot of time
.         if ( maxiter[`i']-bestiter[`i']<60) {c -(}
{txt} 10{com}.                 local tempiter= round(maxiter[`i']*2)+10
{txt} 11{com}.                 {c )-}
{txt} 12{com}.         else {c -(}
{txt} 13{com}.                 local tempiter=round( e(bestiter) * 1.2 )+10
{txt} 14{com}.                 {c )-}
{txt} 15{com}.         {c )-}
{txt}(1 real change made)
{com}Distribution=logistic
predict=nopredict
Trainfraction=.75 Shrink=.1 Bag=.5 maxiter=750 Interaction=1
{txt}Fitting ... 
{res}bestiter= 598
Test R2= .10951812
trainn= 2841
Train R2= .09935987
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
{com}Distribution=logistic
predict=nopredict
Trainfraction=.75 Shrink=.1 Bag=.5 maxiter=728 Interaction=2
{txt}Fitting ... 
{res}bestiter= 481
Test R2= .15191562
trainn= 2841
Train R2= .32299404
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
{com}Distribution=logistic
predict=nopredict
Trainfraction=.75 Shrink=.1 Bag=.5 maxiter=587 Interaction=3
{txt}Fitting ... 
{res}bestiter= 178
Test R2= .16658117
trainn= 2841
Train R2= .45949433
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
{com}Distribution=logistic
predict=nopredict
Trainfraction=.75 Shrink=.1 Bag=.5 maxiter=224 Interaction=4
{txt}Fitting ... 
{res}bestiter= 156
Test R2= .17315769
trainn= 2841
Train R2= .3867784
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
{com}Distribution=logistic
predict=nopredict
Trainfraction=.75 Shrink=.1 Bag=.5 maxiter=197 Interaction=5
{txt}Fitting ... 
{res}bestiter= 165
Test R2= .17597042
trainn= 2841
Train R2= .41768397
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
{com}Distribution=logistic
predict=nopredict
Trainfraction=.75 Shrink=.1 Bag=.5 maxiter=404 Interaction=6
{txt}Fitting ... 
{res}bestiter= 182
Test R2= .18346955
trainn= 2841
Train R2= .63021859
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
{com}Distribution=logistic
predict=nopredict
Trainfraction=.75 Shrink=.1 Bag=.5 maxiter=228 Interaction=8
{txt}Fitting ... 
{res}bestiter= 99
Test R2= .18408629
trainn= 2841
Train R2= .59180888
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
{com}Distribution=logistic
predict=nopredict
Trainfraction=.75 Shrink=.1 Bag=.5 maxiter=129 Interaction=10
{txt}Fitting ... 
{res}bestiter= 96
Test R2= .18024452
trainn= 2841
Train R2= .5194348
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
{com}Distribution=logistic
predict=nopredict
Trainfraction=.75 Shrink=.1 Bag=.5 maxiter=268 Interaction=15
{txt}Fitting ... 
{res}bestiter= 102
Test R2= .18109843
trainn= 2841
Train R2= .78943483
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
{com}Distribution=logistic
predict=nopredict
Trainfraction=.75 Shrink=.1 Bag=.5 maxiter=132 Interaction=20
{txt}Fitting ... 
{res}bestiter= 49
Test R2= .2004606
trainn= 2841
Train R2= .70768153
{txt}(1 real change made)
(1 real change made)
(1 real change made)

{com}. profiler off 
{txt}
{com}. if $profiler ==1 {c -(} 
.         profiler report 
{txt}boost
{res}    10  194.823{txt}  boost
Overall total count = {res}    10
{txt}Overall total time  = {res}   194.823{txt} (sec)
{com}.         {c )-}  
{txt}
{com}. rename myinter interaction
{res}{txt}
{com}. twoway connected Rsquared inter, xtitle("Number of interactions") ///
>         ytitle("R-squared") scheme(s2mono) graphregion(color(white)) 
{res}{txt}
{com}. graph export "$plot\boost_Rsquared.png", replace        width(1500)
{txt}(file C:\Users\chasi_000\Dropbox\Apps\ShareLaTeX\Donde\Figuras\Boost\boost_Rsquared.png written in PNG format)

{com}. 
. 
. ********************************************************************************
. 
. 
. ********************************************************************************
. *Boosting 
. 
. qui egen maxrsq=max(Rsquared)
{txt}
{com}. qui gen iden=_n if Rsquared==maxrsq
{txt}
{com}. qui su iden
{txt}
{com}. 
. local opt_int=`r(mean)'         /*Optimum interaction according to previous process*/
{txt}
{com}. 
. if ( maxiter[`r(mean)']-bestiter[`r(mean)']<60) {c -(}
.         local miter= round(maxiter[`r(mean)']*2.2+10)
.         {c )-}
{txt}
{com}. else {c -(}
.         local miter=bestiter[`r(mean)']+120
.         {c )-}
{txt}
{com}.                                                         /*Maximum number of iterations-if bestiter is closed to maxiter, 
>                                                         increase the number of max iter as the maximum likelihood 
>                                                         iteration may be larger*/
.                                                         
. local shrink=0.05               /*Lower shrinkage values usually improve the test R2 but 
>                                                         they increase the running time dramatically. 
>                                                         Shrinkage can be thought of as a step size*/                                            
{txt}
{com}.                                                 
. capture drop boost_pred boost_pred2
{txt}
{com}. capture profiler clear
{txt}
{com}. profiler on
{txt}
{com}. boost $dep_var $ind_var D_*, dist(logistic) train($trainf) maxiter(`miter') bag(0.5) ///
>         interaction(`opt_int') shrink(`shrink') pred("boost_pred") influence 
influence
Distribution=logistic
predict=boost_pred
Trainfraction=.75 Shrink=.05 Bag=.5 maxiter=169 Interaction=10
{txt}Fitting ... 
Assessing Influence ... 
Predicting ... 
{res}bestiter= 169
Test R2= .18430906
trainn= 2841
Train R2= .43563206
Influence of each variable (Percent):
mujer 2.27698 
mas_prepa 3.4150276 
pb 2.9528618 
fb 2.178962 
tentado 1.9625985 
pr_recup 7.7807251 
prenda_tipo_cd_1 1.6356121 
prenda_tipo_cd_2 3.1006136 
pres_antes 1.8856222 
cta_tanda 2.7950874 
fam_comun 2.9187697 
t_llegar 11.906238 
D_suc1 1.7537505 
D_suc2 2.2632966 
D_suc3 4.2680844 
D_suc4 1.5356633 
D_suc5 1.7983593 
D_suc6 4.955758 
D_week1 3.0775219 
D_week2 2.9661886 
D_week3 1.3765899 
D_week4 2.6629349 
D_week5 1.9103932 
D_week6 2.5934122 
D_razon1 .86092377 
D_razon2 1.4102778 
D_razon3 1.8102234 
D_razon4 1.0704611 
D_edo_civil1 1.5911115 
D_edo_civil2 2.9020182 
D_edo_civil3 1.8690503 
D_edo_civil4 1.1480142 
D_plan_gasto1 1.7797391 
D_plan_gasto2 1.0945534 
D_plan_gasto3 1.4941959 
D_tempt1 2.0216437 
D_tempt2 1.6646039 
D_tempt3 1.7188801 
D_tempt4 1.5932533 
{txt}
{com}. profiler off
{txt}
{com}. if $profiler ==1 {c -(} 
.         profiler report 
{txt}boost
{res}     1   20.114{txt}  boost
Overall total count = {res}     1
{txt}Overall total time  = {res}    20.114{txt} (sec)
{com}.         {c )-}  
{txt}
{com}.         
. gen boost_pred2=round(boost_pred) 
{txt}
{com}. matrix influence = e(influence)
{txt}
{com}. 
. ********************************************************************************
. 
. 
. ********************************************************************************
. *Classification*
. tab $dep_var

{txt}pago_frec_v {c |}
  oluntario {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      3,392       89.55       89.55
{txt}          1 {c |}{res}        396       10.45      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,788      100.00
{txt}
{com}. 
. *Classification for the test data
. tab $dep_var if _n>$trainn

{txt}pago_frec_v {c |}
  oluntario {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        853       90.17       90.17
{txt}          1 {c |}{res}         93        9.83      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        946      100.00
{txt}
{com}. 
. ********************************************************************************
. 
. *Expected value of predicted values
. su $dep_var boost_pred logit_pred swlogit_pred krls_pred if _n >$trainn , d

                    {txt}pago_frec_voluntario
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}        946
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}        946

{txt}50%    {res}        0                      {txt}Mean          {res} .0983087
                        {txt}Largest       Std. Dev.     {res}  .297889
{txt}75%    {res}        0              1
{txt}90%    {res}        0              1       {txt}Variance      {res} .0887379
{txt}95%    {res}        1              1       {txt}Skewness      {res} 2.698346
{txt}99%    {res}        1              1       {txt}Kurtosis      {res}  8.28107

                         {txt}boost_pred
{hline 61}
      Percentiles      Smallest
 1%    {res} .0226431       .0191531
{txt} 5%    {res} .0279959       .0199648
{txt}10%    {res} .0313389       .0203825       {txt}Obs         {res}        946
{txt}25%    {res} .0385519       .0203825       {txt}Sum of Wgt. {res}        946

{txt}50%    {res}   .06435                      {txt}Mean          {res} .1027972
                        {txt}Largest       Std. Dev.     {res} .1074835
{txt}75%    {res} .1193068       .6386344
{txt}90%    {res} .2096957       .6489426       {txt}Variance      {res} .0115527
{txt}95%    {res} .3215888       .6489426       {txt}Skewness      {res} 2.728833
{txt}99%    {res} .5562639       .7341403       {txt}Kurtosis      {res} 11.37523

                  {txt}Pr(pago_frec_voluntario)
{hline 61}
      Percentiles      Smallest
 1%    {res} .0113032       .0060663
{txt} 5%    {res} .0185364        .006202
{txt}10%    {res} .0259744        .006202       {txt}Obs         {res}        946
{txt}25%    {res} .0456811       .0088997       {txt}Sum of Wgt. {res}        946

{txt}50%    {res} .0836121                      {txt}Mean          {res} .1033373
                        {txt}Largest       Std. Dev.     {res} .0755642
{txt}75%    {res} .1416844       .3713817
{txt}90%    {res} .2147968       .3849934       {txt}Variance      {res} .0057099
{txt}95%    {res} .2525215       .3856427       {txt}Skewness      {res} 1.168338
{txt}99%    {res} .3396185       .3879799       {txt}Kurtosis      {res} 3.991208

                  {txt}Pr(pago_frec_voluntario)
{hline 61}
      Percentiles      Smallest
 1%    {res}  .047704        .033187
{txt} 5%    {res} .0627337       .0366804
{txt}10%    {res}  .070993       .0428324       {txt}Obs         {res}        946
{txt}25%    {res} .0851853       .0440697       {txt}Sum of Wgt. {res}        946

{txt}50%    {res} .1038709                      {txt}Mean          {res} .1076139
                        {txt}Largest       Std. Dev.     {res} .0313535
{txt}75%    {res} .1272863       .2229914
{txt}90%    {res} .1485924       .2300098       {txt}Variance      {res}  .000983
{txt}95%    {res} .1624143       .2300098       {txt}Skewness      {res} .8017333
{txt}99%    {res} .1932929       .3003341       {txt}Kurtosis      {res} 4.797729

                          {txt}krls_pred
{hline 61}
      Percentiles      Smallest
 1%    {res}-5.345724      -6.466747
{txt} 5%    {res}-4.055224      -5.965169
{txt}10%    {res} -3.25444      -5.851512       {txt}Obs         {res}        946
{txt}25%    {res}-2.281432      -5.851512       {txt}Sum of Wgt. {res}        946

{txt}50%    {res} -.788571                      {txt}Mean          {res}-.7867257
                        {txt}Largest       Std. Dev.     {res} 2.021064
{txt}75%    {res} .5730031        4.86154
{txt}90%    {res} 1.887062       5.462633       {txt}Variance      {res} 4.084698
{txt}95%    {res} 2.607172       5.462633       {txt}Skewness      {res} .1155362
{txt}99%    {res} 4.040582       5.514528       {txt}Kurtosis      {res} 2.842283
{txt}
{com}. 
. 
. *Difference in l1 of probabilities (predicted values)
. qui gen error_boost=abs(boost_pred-     $dep_var) 
{txt}
{com}.         su error_boost if _n>$trainn

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}error_boost {c |}{res}       946     .155182    .2246429   .0191531   .9594966
{txt}
{com}. qui gen error_logit=abs(logit_pred-     $dep_var) 
{txt}
{com}.         su error_logit if _n>$trainn

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 1}error_logit {c |}{res}       946      .17032    .2332677   .0060663   .9761052
{txt}
{com}. qui gen error_swlogit=abs(swlogit_pred- $dep_var) 
{txt}
{com}.         su error_swlogit if _n>$trainn

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
error_swlo~t {c |}{res}       946    .1838242    .2346059    .033187   .9559302
{txt}
{com}. qui gen error_krls=abs(krls_pred-       $dep_var) 
{txt}
{com}.         su error_krls if _n>$trainn

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
{space 2}error_krls {c |}{res}       946    1.748331    1.272567   .0032684   6.466747
{txt}
{com}.         
. *Fitness
. tab boost_pred2 $dep_var if _n>$trainn, cell
{txt}
{c TLC}{hline 17}{c TRC}
{c |} Key{col 19}{c |}
{c LT}{hline 17}{c RT}
{c |}{space 4}{it:frequency}{col 19}{c |}
{c |}{space 1}{it:cell percentage}{col 19}{c |}
{c BLC}{hline 17}{c BRC}

boost_pred {c |} pago_frec_voluntario
         2 {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}       843         83 {txt}{c |}{res}       926 
           {txt}{c |}{res}     89.11       8.77 {txt}{c |}{res}     97.89 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         1 {c |}{res}        10         10 {txt}{c |}{res}        20 
           {txt}{c |}{res}      1.06       1.06 {txt}{c |}{res}      2.11 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       853         93 {txt}{c |}{res}       946 
           {txt}{c |}{res}     90.17       9.83 {txt}{c |}{res}    100.00 

{txt}
{com}. tab logit_pred2 $dep_var  if _n > $trainn, cell
{txt}
{c TLC}{hline 17}{c TRC}
{c |} Key{col 19}{c |}
{c LT}{hline 17}{c RT}
{c |}{space 4}{it:frequency}{col 19}{c |}
{c |}{space 1}{it:cell percentage}{col 19}{c |}
{c BLC}{hline 17}{c BRC}

logit_pred {c |} pago_frec_voluntario
         2 {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}       853         93 {txt}{c |}{res}       946 
           {txt}{c |}{res}     90.17       9.83 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       853         93 {txt}{c |}{res}       946 
           {txt}{c |}{res}     90.17       9.83 {txt}{c |}{res}    100.00 

{txt}
{com}. tab swlogit_pred2 $dep_var  if _n > $trainn, cell
{txt}
{c TLC}{hline 17}{c TRC}
{c |} Key{col 19}{c |}
{c LT}{hline 17}{c RT}
{c |}{space 4}{it:frequency}{col 19}{c |}
{c |}{space 1}{it:cell percentage}{col 19}{c |}
{c BLC}{hline 17}{c BRC}

swlogit_pr {c |} pago_frec_voluntario
       ed2 {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}       853         93 {txt}{c |}{res}       946 
           {txt}{c |}{res}     90.17       9.83 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       853         93 {txt}{c |}{res}       946 
           {txt}{c |}{res}     90.17       9.83 {txt}{c |}{res}    100.00 

{txt}
{com}. tab krls_pred2 $dep_var  if _n > $trainn, cell
{txt}
{c TLC}{hline 17}{c TRC}
{c |} Key{col 19}{c |}
{c LT}{hline 17}{c RT}
{c |}{space 4}{it:frequency}{col 19}{c |}
{c |}{space 1}{it:cell percentage}{col 19}{c |}
{c BLC}{hline 17}{c BRC}

           {c |} pago_frec_voluntario
krls_pred2 {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
        -6 {c |}{res}         8          0 {txt}{c |}{res}         8 
           {txt}{c |}{res}      0.85       0.00 {txt}{c |}{res}      0.85 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
        -5 {c |}{res}        20          0 {txt}{c |}{res}        20 
           {txt}{c |}{res}      2.11       0.00 {txt}{c |}{res}      2.11 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
        -4 {c |}{res}        43          0 {txt}{c |}{res}        43 
           {txt}{c |}{res}      4.55       0.00 {txt}{c |}{res}      4.55 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
        -3 {c |}{res}       123          5 {txt}{c |}{res}       128 
           {txt}{c |}{res}     13.00       0.53 {txt}{c |}{res}     13.53 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
        -2 {c |}{res}       159          5 {txt}{c |}{res}       164 
           {txt}{c |}{res}     16.81       0.53 {txt}{c |}{res}     17.34 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
        -1 {c |}{res}       150         11 {txt}{c |}{res}       161 
           {txt}{c |}{res}     15.86       1.16 {txt}{c |}{res}     17.02 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}       153         23 {txt}{c |}{res}       176 
           {txt}{c |}{res}     16.17       2.43 {txt}{c |}{res}     18.60 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         1 {c |}{res}       107         22 {txt}{c |}{res}       129 
           {txt}{c |}{res}     11.31       2.33 {txt}{c |}{res}     13.64 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         2 {c |}{res}        46         12 {txt}{c |}{res}        58 
           {txt}{c |}{res}      4.86       1.27 {txt}{c |}{res}      6.13 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         3 {c |}{res}        30         12 {txt}{c |}{res}        42 
           {txt}{c |}{res}      3.17       1.27 {txt}{c |}{res}      4.44 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         4 {c |}{res}        11          2 {txt}{c |}{res}        13 
           {txt}{c |}{res}      1.16       0.21 {txt}{c |}{res}      1.37 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         5 {c |}{res}         3          0 {txt}{c |}{res}         3 
           {txt}{c |}{res}      0.32       0.00 {txt}{c |}{res}      0.32 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         6 {c |}{res}         0          1 {txt}{c |}{res}         1 
           {txt}{c |}{res}      0.00       0.11 {txt}{c |}{res}      0.11 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       853         93 {txt}{c |}{res}       946 
           {txt}{c |}{res}     90.17       9.83 {txt}{c |}{res}    100.00 

{txt}
{com}. 
. *Correlation
. corr $dep_var boost_pred2 logit_pred2 swlogit_pred2 krls_pred2 if _n>$trainn
{txt}(obs=946)

             {c |} pago_f~o boost_~2 logit_~2 swlogi~2 krls_p~2
{hline 13}{c +}{hline 45}
pago_frec_~o {c |}{res}   1.0000
 {txt}boost_pred2 {c |}{res}   0.1983   1.0000
 {txt}logit_pred2 {c |}{res}        .        .        .
{txt}swlogit_pr~2 {c |}{res}        .        .        .        .
  {txt}krls_pred2 {c |}{res}   0.2334   0.2127        .        .   1.0000

{txt}
{com}. 
. ********************************************************************************
. 
. 
. ********************************************************************************
. *Compare the R^2 of boosted and linear models on test data
. 
. * compute Rsquared on test data - logit
. 
. gen regress_eps=$dep_var-logit_pred 
{txt}
{com}. gen regress_eps2= regress_eps*regress_eps 
{txt}
{com}. replace regress_eps2=0 if _n<=$trainn  
{txt}(2842 real changes made)

{com}. gen regress_ss=sum(regress_eps2)
{txt}
{com}. local mse=regress_ss[_N] / (_N-$trainn)
{txt}
{com}. sum $dep_var if _n>$trainn

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
pago_frec_~o {c |}{res}       946    .0983087     .297889          0          1
{txt}
{com}. local var=r(Var)
{txt}
{com}. local regress_r2= (`var'-`mse')/`var'
{txt}
{com}. di " "
{res} 
{txt}
{com}. di "Logit regression : mse=" `mse' " var=" `var'  " regress r2="  `regress_r2'
{res}Logit regression : mse=.0833652 var=.08873788 regress r2=.06054547
{txt}
{com}. 
. * compute Rsquared on test data - stepwise logit
. 
. gen swregress_eps=$dep_var-swlogit_pred 
{txt}
{com}. gen swregress_eps2= swregress_eps*swregress_eps 
{txt}
{com}. replace swregress_eps2=0 if _n<=$trainn  
{txt}(2842 real changes made)

{com}. gen swregress_ss=sum(swregress_eps2)
{txt}
{com}. local mse=swregress_ss[_N] / (_N-$trainn)
{txt}
{com}. sum $dep_var if _n>$trainn

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
pago_frec_~o {c |}{res}       946    .0983087     .297889          0          1
{txt}
{com}. local var=r(Var)
{txt}
{com}. local swregress_r2= (`var'-`mse')/`var'
{txt}
{com}. di " "
{res} 
{txt}
{com}. di "Stepwise Logit regression : mse=" `mse' " var=" `var'  " regress r2="  `swregress_r2'
{res}Stepwise Logit regression : mse=.08877309 var=.08873788 regress r2=-.00039687
{txt}
{com}. 
. * compute Rsquared on test data - krls
. 
. gen krlsregress_eps=$dep_var-krls_pred 
{txt}
{com}. gen krlsregress_eps2= krlsregress_eps*krlsregress_eps 
{txt}
{com}. replace krlsregress_eps2=0 if _n<=$trainn  
{txt}(2842 real changes made)

{com}. gen krlsregress_ss=sum(krlsregress_eps2)
{txt}
{com}. local mse=krlsregress_ss[_N] / (_N-$trainn)
{txt}
{com}. sum $dep_var if _n>$trainn

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
pago_frec_~o {c |}{res}       946    .0983087     .297889          0          1
{txt}
{com}. local var=r(Var)
{txt}
{com}. local krlsregress_r2= (`var'-`mse')/`var'
{txt}
{com}. di " "
{res} 
{txt}
{com}. di "KRLS: mse=" `mse' " var=" `var'  " regress r2="  `krlsregress_r2'
{res}KRLS: mse=4.6743758 var=.08873788 regress r2=-51.676218
{txt}
{com}. 
. * compute Rsquared on test data - boosting
. 
. gen boost_eps=$dep_var-boost_pred 
{txt}
{com}. gen boost_eps2= boost_eps*boost_eps 
{txt}
{com}. replace boost_eps2=0 if _n<=$trainn  
{txt}(2842 real changes made)

{com}. gen boost_ss=sum(boost_eps2)
{txt}
{com}. local mse=boost_ss[_N] / (_N-$trainn)
{txt}
{com}. sum $dep_var if _n>$trainn

{txt}    Variable {c |}       Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 56}
pago_frec_~o {c |}{res}       946    .0983087     .297889          0          1
{txt}
{com}. local var=r(Var)
{txt}
{com}. local boost_r2= (`var'-`mse')/`var'
{txt}
{com}. di " "
{res} 
{txt}
{com}. di "Boosting:  mse=" `mse' " var=" `var'  " boost r2="  `boost_r2'
{res}Boosting:  mse=.07449251 var=.08873788 boost r2=.16053307
{txt}
{com}. 
. ********************************************************************************
. 
. 
. ********************************************************************************
. * Calibration plot
. * scatter plot of predicted versus actual values of $dep_var
. * a straight line would indicate a perfect fit
. local trainm1=$trainn +1
{txt}
{com}. qui count
{txt}
{com}. gen straight=.
{txt}(3788 missing values generated)

{com}. replace straight=$dep_var
{txt}(3788 real changes made)

{com}. twoway  (lowess $dep_var  logit_pred  in 1/$trainn, bwidth(0.2) clpattern(dot)) ///
>                 (lowess $dep_var boost_pred in 1/$trainn , bwidth(0.2) clpattern(dash)) ///
>                 (lowess $dep_var  krls_pred  in 1/$trainn, bwidth(0.2) clpattern(dash_dot)) ///
>                 (lfit straight $dep_var)  , xtitle("Fitted Values") ///
>                 legend(label(1 "Logistic Regression") label(2 "Boosting") label(3 "KRLS") ///
>                 label(4 "Fitted Values=Actual Values") )  graphregion(color(white))
{res}{txt}
{com}. graph export "$plot\boost_calibration_insample.png", replace    width(1500)             
{txt}(file C:\Users\chasi_000\Dropbox\Apps\ShareLaTeX\Donde\Figuras\Boost\boost_calibration_insample.png written in PNG format)

{com}. 
. local trainm1=$trainn +1
{txt}
{com}. qui count               
{txt}
{com}. twoway  (lowess $dep_var  logit_pred  in `trainm1'/`r(N)', bwidth(0.2) clpattern(dot)) ///
>         (lowess $dep_var boost_pred in `trainm1'/`r(N)' , bwidth(0.2) clpattern(dash)) ///
>                 (lowess $dep_var  krls_pred  in `trainm1'/`r(N)', bwidth(0.2) clpattern(dash_dot)) ///
>                 (lfit straight $dep_var)  , xtitle("Fitted Values") ///
>                 legend(label(1 "Logistic Regression") label(2 "Boosting") label(3 "KRLS") ///
>                 label(4 "Fitted Values=Actual Values") )  graphregion(color(white))
{res}{txt}
{com}. graph export "$plot\boost_calibration_outsample.png", replace   width(1500)
{txt}(file C:\Users\chasi_000\Dropbox\Apps\ShareLaTeX\Donde\Figuras\Boost\boost_calibration_outsample.png written in PNG format)

{com}. ********************************************************************************
. 
. 
. 
. ********************************************************************************
. *Influence plot
. svmat influence
{txt}
{com}. gen id=_n
{txt}
{com}. replace id=. if missing(influence)
{txt}(3749 real changes made, 3749 to missing)

{com}. 
. 
. graph bar (mean) influence, over(id) ytitle(Percentage Influence) ///
>         scheme(s2mono) graphregion(color(white))
{res}{txt}
{com}. graph export "$plot\boost_influence.png", replace       width(1500)
{txt}(file C:\Users\chasi_000\Dropbox\Apps\ShareLaTeX\Donde\Figuras\Boost\boost_influence.png written in PNG format)

{com}. 
. ********************************************************************************
. 
. 
. ********************************************************************************
. *ROC curve
. gen insample=1 in 1/$trainn
{txt}(946 missing values generated)

{com}. replace insample=0 if missing(insample)
{txt}(946 real changes made)

{com}. 
. preserve
{txt}
{com}. 
. local sm=90
{txt}
{com}. sample `sm'
{txt}(379 observations deleted)

{com}. 
. capture profiler clear
{txt}
{com}. profiler on
{txt}
{com}.         *In sample
. roccomp $dep_var logit_pred swlogit_pred krls_pred boost_pred  if insample==1 , graph summary ///
>         legend(label(1 "Logit") label(2 "SW Logit") label(3 "KRLS") ///
>                 label(4 "Boosting") label(5 "Reference"))  graphregion(color(white))
{res}
{txt}{col 31}ROC{col 54}{c -}Asymptotic Normal{hline 2}
{col 17}   Obs       Area     Std. Err.      [95% Conf. Interval]
{hline 73}
{res}logit_pred        2564     0.7259       0.0157        0.69520     0.75659
swlogit_pred      2564     0.5914       0.0177        0.55677     0.62613
krls_pred         2564     0.7707       0.0149        0.74157     0.79982
boost_pred        2564     0.9516       0.0074        0.93714     0.96603
{txt}{hline 73}
Ho: area({res}logit_pred{txt}) = area({res}swlogit_pred{txt}) = area({res}krls_pred{txt}) = area({res}boost_pred{txt})
    chi2({res}3{txt}) = {res}  566.49{txt}       Prob>chi2 = {res}  0.0000
{txt}
{com}. profiler off
{txt}
{com}. if $profiler ==1 {c -(} 
.         profiler report 
{txt}roccomp
{res}     1    0.000{txt}  roccomp
{res}     1    0.311{txt}  ROCcomp
{res}     4   50.321{txt}  COMparea
{res}     1    0.047{txt}  MYTEst
{res}         50.679{txt}  Total
_get_gropts
{res}    10    0.003{txt}  _get_gropts
_check4gropts
{res}    13    0.017{txt}  _check4gropts
unab
{res}     9    0.001{txt}  unab
label
{res}  7457    0.507{txt}  label
logistic
{res}     8    0.001{txt}  logistic
{res}     8    0.002{txt}  Estimate
{res}     8    0.001{txt}  Display
{res}          0.004{txt}  Total
_vce_parserun
{res}     8    0.000{txt}  _vce_parserun
{res}     8    0.000{txt}  MYRESULT
{res}          0.000{txt}  Total
_on_colon_parse
{res}     8    0.000{txt}  _on_colon_parse
logit
{res}    16    0.018{txt}  logit
logit_10
{res}    16    0.042{txt}  logit_10
{res}     8    0.000{txt}  Display
{res}          0.042{txt}  Total
lsens
{res}     4    0.017{txt}  lsens
lfit_p
{res}     8    0.011{txt}  lfit_p
predict
{res}    12    0.000{txt}  predict
logistic_p
{res}    12    0.001{txt}  logistic_p
logit_p
{res}    12    0.021{txt}  logit_p
_pred_se
{res}    12    0.002{txt}  _pred_se
opts_exclusive
{res}    12    0.000{txt}  opts_exclusive
lsens_x
{res}     8    0.087{txt}  lsens_x
roctab
{res}     4    0.087{txt}  roctab
{res}     4    0.006{txt}  MYLRoc
{res}     4   32.233{txt}  DeLongSE
{res}     4    0.001{txt}  MYDIspl
{res}         32.327{txt}  Total
egen
{res}    44    0.024{txt}  egen
findfile
{res}   224    0.134{txt}  findfile
_ggroup
{res}     4    4.239{txt}  _ggroup
_gsum
{res}    40    0.000{txt}  _gsum
_gtotal
{res}    40    0.075{txt}  _gtotal
append
{res}     3    0.007{txt}  append
merge
{res}     3    0.000{txt}  merge
merge_10
{res}     3    0.001{txt}  merge_10
graph
{res}     1    0.000{txt}  graph
{res}     1    0.022{txt}  Graph
{res}     1    0.000{txt}  MergeBy
{res}     1    0.000{txt}  _unab_do
{res}     1    0.000{txt}  SetFixedSize
{res}          0.022{txt}  Total
gr_setscheme
{res}     1    0.000{txt}  gr_setscheme
scheme
{res}     2    0.000{txt}  new
{res}     1    0.242{txt}  setscheme
{res}   898    0.147{txt}  style
{res}          0.389{txt}  Total
gr_current
{res}     1    0.000{txt}  gr_current
gs_stat
{res}     2    0.000{txt}  gs_stat
{res}     1    0.000{txt}  Query
{res}     2    0.000{txt}  Stat
{res}     1    0.000{txt}  Assert
{res}          0.000{txt}  Total
gr_drop
{res}     1    0.047{txt}  gr_drop
serset
{res}     2    0.000{txt}  destructor
{res}     5    0.020{txt}  new
{res}     5    0.000{txt}  set_labels
{res}     1    0.000{txt}  sort
{res}     6    0.000{txt}  set
{res}    10    0.000{txt}  seriesof
{res}          0.020{txt}  Total
global_g
{res}     2    0.000{txt}  current_graph_resync
{res}     2    0.000{txt}  set_current_graph
{res}     1    0.000{txt}  ResetEditor
{res}          0.000{txt}  Total
ticksetstyle
{res}     0    0.001{txt}  Graph
{res}    20    0.000{txt}  new
{res}          0.001{txt}  Total
numticks_g
{res}     9    0.000{txt}  new
numstyle
{res}   300    0.000{txt}  new
{res}   300    0.000{txt}  set
{res}   315    0.050{txt}  setstyle
{res}    38    0.000{txt}  setting
{res}          0.050{txt}  Total
style
{res}     0    0.002{txt}  new
{res}    41    0.000{txt}  _populate_stylenames
{res}   174    0.327{txt}  _read_style
{res}     0    0.017{txt}  setstyle
{res}     0    0.000{txt}  Graph
{res}     0    0.005{txt}  edit
{res}     0    0.000{txt}  set
{res}    66    0.086{txt}  editstyle
{res}    55    0.033{txt}  remake_as_copy
{res}     0    0.000{txt}  _declare_view
{res}     0    0.016{txt}  _fr_runlog
{res}     0    0.000{txt}  _set_orientation
{res}     0    0.000{txt}  set_true
{res}     0    0.000{txt}  set_false
{res}     0    0.000{txt}  _fr_legend_parse_and_log
{res}     0    0.001{txt}  newkey
{res}     5    0.000{txt}  Restyle
{res}     5    0.000{txt}  RestyleVal
{res}    70    0.000{txt}  _reset_attrib_val
{res}     0    0.000{txt}  real_draw
{res}          0.487{txt}  Total
tickstyle
{res}     0    0.000{txt}  Graph
{res}     9    0.000{txt}  new
{res}     2    0.000{txt}  size
{res}    16    0.000{txt}  setgdifull
{res}    16    0.000{txt}  setgdi
{res}    32    0.015{txt}  tick_length
{res}          0.015{txt}  Total
linestyle
{res}     0    0.000{txt}  Graph
{res}    77    0.017{txt}  new
{res}    77    0.001{txt}  set
{res}     3    0.000{txt}  blank_line
{res}    61    0.000{txt}  setgdi
{res}    34    0.000{txt}  setgdifull
{res}          0.018{txt}  Total
linewidth
{res}    31    0.000{txt}  new
color
{res}     0    0.015{txt}  Graph
{res}   119    0.015{txt}  new
{res}    10    0.000{txt}  set
{res}   118    0.018{txt}  setstyle
{res}   118    0.001{txt}  _unabbrev
{res}     3    0.000{txt}  setting
{res}     3    0.000{txt}  setintensity100
{res}     3    0.000{txt}  setintensity
{res}    95    0.018{txt}  setgdi
{res}     3    0.000{txt}  setrgb
{res}          0.067{txt}  Total
fixedcode
{res}     4    0.000{txt}  new
code
{res}   138    0.000{txt}  set
{res}     4    0.000{txt}  new
{res}     4    0.016{txt}  add
{res}   979    0.000{txt}  setting
{res}          0.016{txt}  Total
linepattern
{res}    31    0.000{txt}  new
{res}    31    0.000{txt}  set
{res}    31    0.001{txt}  setstyle
{res}    61    0.000{txt}  setgdi
{res}          0.001{txt}  Total
textstyle
{res}     0    0.000{txt}  Graph
{res}    10    0.000{txt}  new
{res}    10    0.000{txt}  set
{res}    16    0.016{txt}  setgdi
{res}          0.016{txt}  Total
anglestyle
{res}    58    0.002{txt}  new
{res}   121    0.000{txt}  _unabbrev
{res}          0.002{txt}  Total
tickposition
{res}     4    0.000{txt}  _unabbrev
yesno
{res}   190    0.001{txt}  _unabbrev
{res}    11    0.000{txt}  set_true
{res}    10    0.000{txt}  set_false
{res}     2    0.000{txt}  isfalse
{res}          0.001{txt}  Total
gridstyle
{res}     0    0.000{txt}  Graph
{res}     9    0.000{txt}  new
{res}          0.000{txt}  Total
axisstyle
{res}     0    0.000{txt}  Graph
{res}     4    0.000{txt}  _unabbrev
{res}     1    0.000{txt}  new
{res}     4    0.000{txt}  extend
{res}          0.000{txt}  Total
axis
{res}     0    0.015{txt}  Graph
{res}     3    0.000{txt}  new
{res}     3    0.000{txt}  set
{res}     3    0.000{txt}  set_formats
{res}     3    0.000{txt}  set_scales
{res}     5    0.000{txt}  set_ticks
{res}     6    0.000{txt}  reset_scale
{res}     6    0.000{txt}  overallmin
{res}     6    0.000{txt}  overallmax
{res}     1    0.000{txt}  ysize
{res}     1    0.000{txt}  ysize_notitle
{res}     2    0.000{txt}  _tick_and_label_width
{res}    24    0.000{txt}  _value_label_series
{res}     1    0.000{txt}  xsize
{res}     1    0.000{txt}  xsize_notitle
{res}     4    0.000{txt}  draw
{res}     4    0.015{txt}  real_draw
{res}     4    0.000{txt}  Selected
{res}     2    0.000{txt}  _declare_array
{res}     2    0.000{txt}  _draw_title
{res}          0.030{txt}  Total
textboxstyle
{res}     0    0.000{txt}  Graph
{res}    10    0.000{txt}  new
{res}    10    0.000{txt}  set
{res}     7    0.000{txt}  setgdifull
{res}     7    0.000{txt}  setgdi
{res}          0.000{txt}  Total
margin
{res}    70    0.000{txt}  new
{res}    74    0.039{txt}  setstyle
{res}    70    0.000{txt}  set
{res}    15    0.000{txt}  setgdi
{res}    82    0.016{txt}  gmleft
{res}    82    0.000{txt}  gmbottom
{res}    73    0.000{txt}  gmright
{res}    73    0.000{txt}  gmtop
{res}     3    0.000{txt}  set2gm
{res}          0.055{txt}  Total
compass2dir
{res}    52    0.000{txt}  _unabbrev
{res}    10    0.000{txt}  isnorth
{res}    10    0.000{txt}  issouth
{res}     6    0.000{txt}  iseast
{res}     6    0.000{txt}  iswest
{res}          0.000{txt}  Total
textbox
{res}     0    0.000{txt}  Graph
{res}    22    0.000{txt}  new
{res}    47    0.000{txt}  set
{res}    52    0.015{txt}  edit
{res}     5    0.000{txt}  _set_orientation
{res}     5    0.016{txt}  resetstyle
{res}   122    0.000{txt}  not_drawn
{res}    39    0.000{txt}  ysize
{res}    49    0.000{txt}  textheight
{res}     4    0.000{txt}  xsize
{res}     7    0.000{txt}  draw
{res}     7    0.000{txt}  _get_x_y_delta
{res}          0.031{txt}  Total
tb_orientstyle
{res}     6    0.000{txt}  _unabbrev
anyview_g
{res}     0    0.000{txt}  Graph
{res}     9    0.000{txt}  new
{res}    26    0.000{txt}  set
{res}    12    0.000{txt}  setstyle
{res}    35    0.001{txt}  set_gdi_posn
{res}    70    0.001{txt}  gdi_yposn
{res}    70    0.000{txt}  gdi_xposn
{res}    15    0.001{txt}  compass_draw
{res}     7    0.000{txt}  set_gdi_posn_notrans
{res}          0.003{txt}  Total
stretchability
{res}     2    0.000{txt}  new
sized_textbox
{res}    22    0.000{txt}  new
{res}    47    0.000{txt}  set
{res}    40    0.016{txt}  ysize
{res}    40    0.002{txt}  xsize
{res}    37    0.000{txt}  textwidth
{res}    23    0.000{txt}  draw
{res}     7    0.000{txt}  _super_draw
{res}          0.018{txt}  Total
scale
{res}     0    0.000{txt}  Graph
{res}     3    0.000{txt}  new
{res}     3    0.000{txt}  set
{res}     2    0.000{txt}  reinit
{res}    10    0.000{txt}  addmin
{res}    10    0.000{txt}  addmax
{res}     2    0.000{txt}  add_axis
{res}     6    0.000{txt}  reset_from_axes
{res}     6    0.000{txt}  setgdi
{res}          0.000{txt}  Total
transform
{res}     0    0.000{txt}  Graph
{res}     7    0.000{txt}  new
{res}     7    0.000{txt}  set
{res}    17    0.000{txt}  get_from_gdi
{res}    99    0.015{txt}  translate
{res}   103    0.000{txt}  reset
{res}          0.015{txt}  Total
twowaygraph_g
{res}     0    0.000{txt}  Graph
{res}     1    0.016{txt}  new
{res}     1    0.033{txt}  parse
{res}     1    0.000{txt}  SetCheckPlotregion
{res}     5    0.000{txt}  _unab_cmd
{res}     5    0.000{txt}  ParseOpts
{res}     1    0.000{txt}  create_axes
{res}     1    0.000{txt}  n_yaxes
{res}     1    0.000{txt}  n_xaxes
{res}          0.049{txt}  Total
graphstyle
{res}     0    0.016{txt}  Graph
gridringstyle
{res}    37    0.000{txt}  _unabbrev
plotregionstyle
{res}     0    0.000{txt}  Graph
{res}     5    0.000{txt}  new
{res}     6    0.000{txt}  set
{res}          0.000{txt}  Total
areastyle
{res}     0    0.000{txt}  Graph
{res}    22    0.000{txt}  new
{res}    28    0.000{txt}  set
{res}     8    0.000{txt}  is_drawn
{res}     3    0.000{txt}  draw
{res}     3    0.000{txt}  patterned_line
{res}     3    0.000{txt}  setgdifull
{res}     3    0.000{txt}  setgdi
{res}          0.000{txt}  Total
shadestyle
{res}     0    0.000{txt}  Graph
{res}    12    0.000{txt}  new
{res}    12    0.000{txt}  set
{res}     3    0.000{txt}  setgdi
{res}          0.000{txt}  Total
graph_g
{res}     0    0.000{txt}  Graph
{res}     1    0.000{txt}  new
{res}     1    0.000{txt}  ParseAndLogAxes
{res}     4    0.000{txt}  _axisnum
{res}     1    0.000{txt}  parse_and_log_titles
{res}     1    0.000{txt}  parse_and_log_spacers
{res}     1    0.116{txt}  drawgraph
{res}     1    0.000{txt}  draw
{res}     1    0.000{txt}  _use_aspect_ratio
{res}     1    0.000{txt}  _has_spacers
{res}     1    0.000{txt}  record_header
{res}     1    0.000{txt}  ClearEditor
{res}     1    0.000{txt}  SetUndoRedoMenus
{res}          0.116{txt}  Total
stretch_g
{res}     2    0.000{txt}  new
grid
{res}     0    0.000{txt}  Graph
{res}     5    0.000{txt}  new
{res}    46    0.021{txt}  insert
{res}    46    0.000{txt}  _set_direction
{res}    46    0.004{txt}  _add_view
{res}    46    0.003{txt}  _declare_view
{res}     7    0.000{txt}  _find_ringcol
{res}    16    0.021{txt}  _find_ringrow
{res}     3    0.001{txt}  list_ofclass
{res}     3    0.000{txt}  draw_setup1
{res}     3    0.000{txt}  _set_rensize
{res}     3    0.001{txt}  draw_setup2
{res}     6    0.000{txt}  _align
{res}     3    0.000{txt}  position
{res}     6    0.000{txt}  _pos_dim
{res}    90    0.031{txt}  _update_pos
{res}     8    0.000{txt}  ysize
{res}    16    0.016{txt}  _fixed_sz
{res}   230    0.033{txt}  _do_fixed
{res}   230    0.016{txt}  _adj_span
{res}     6    0.000{txt}  _set_sizes
{res}     6    0.000{txt}  _sum_fixed
{res}     6    0.000{txt}  _posn_from_size
{res}     8    0.000{txt}  xsize
{res}     1    0.000{txt}  list_ofclass_indices
{res}     1    0.000{txt}  draw_cell
{res}    46    0.018{txt}  _draw_cell
{res}     3    0.000{txt}  draw_cells
{res}     2    0.000{txt}  draw
{res}     1    0.000{txt}  _shr_only_ct
{res}          0.165{txt}  Total
container
{res}     0    0.000{txt}  Graph
{res}     5    0.016{txt}  new
{res}     2    0.000{txt}  set_gu_scaling
{res}     3    0.000{txt}  get_gu_scaling
{res}     3    0.000{txt}  reset_gu_scaling
{res}          0.016{txt}  Total
clockdir
{res}    25    0.000{txt}  _unabbrev
{res}     9    0.000{txt}  relative_position
{res}     9    0.000{txt}  iseast
{res}     9    0.000{txt}  iswest
{res}     9    0.000{txt}  issouth
{res}     9    0.000{txt}  compass2style
{res}     8    0.000{txt}  horizontal_style
{res}     4    0.001{txt}  isnorth
{res}          0.001{txt}  Total
_fr_area_parse_and_log
{res}     3    0.000{txt}  _fr_area_parse_and_log
{res}     1    0.000{txt}  _fr_area_parse_and_log_once
{res}          0.000{txt}  Total
cutil
{res}     5    0.000{txt}  cutil
classutil
{res}     5    0.015{txt}  classutil
{res}     5    0.016{txt}  Which
{res}     5    0.000{txt}  GetClassName
{res}          0.031{txt}  Total
twoway_yxview_parse
{res}     5    0.001{txt}  parse
{res}    15    0.000{txt}  BarOrBarDerived
{res}     5    0.000{txt}  parse_opts
{res}     5    0.004{txt}  factor
{res}     5    0.000{txt}  FactorPlot
{res}     1    0.000{txt}  log_touse
{res}     5    0.000{txt}  log_create_view
{res}     5    0.000{txt}  _type_suffix
{res}     5    0.000{txt}  log_edits
{res}          0.005{txt}  Total
twoway_function_parse
{res}     1    0.000{txt}  new
{res}     1    0.000{txt}  parse
{res}     1    0.000{txt}  log_create_serset
{res}     1    0.000{txt}  log_edits
{res}          0.000{txt}  Total
twoway__function_gen
{res}     2    0.015{txt}  twoway__function_gen
{res}     2    0.000{txt}  CheckGenOpt
{res}     1    0.000{txt}  GenData
{res}          0.015{txt}  Total
_fr_runlog
{res}     4    0.046{txt}  _fr_runlog
series
{res}    10    0.018{txt}  new
{res}    10    0.000{txt}  set_labels
{res}    15    0.000{txt}  label_or_name
{res}          0.018{txt}  Total
plotregion
{res}     0    0.000{txt}  _declare_view
{res}     1    0.000{txt}  new
{res}     1    0.000{txt}  set
{res}     1    0.000{txt}  clear_scales
{res}     1    0.000{txt}  reset_scales
{res}     5    0.000{txt}  _set_scales
{res}     2    0.000{txt}  dimtitle_mquoted
{res}     2    0.000{txt}  dimtitle
{res}     4    0.000{txt}  addaxis
{res}     6    0.000{txt}  dimformat
{res}     1    0.000{txt}  list_ofclass
{res}     2    0.000{txt}  draw
{res}     2    0.000{txt}  xsize
{res}     2    0.000{txt}  ysize
{res}     2    0.000{txt}  _sized_draw
{res}     2    0.000{txt}  real_draw
{res}          0.000{txt}  Total
cell
{res}    46    0.000{txt}  _prse_set_span
{res}    92    0.000{txt}  _set_span
{res}          0.000{txt}  Total
yxtype
{res}     7    0.000{txt}  _unabbrev
symbol
{res}    14    0.000{txt}  _unabbrev
markerstyle
{res}     0    0.000{txt}  _fr_runlog
{res}    12    0.000{txt}  new
{res}     4    0.000{txt}  drawn
{res}     8    0.000{txt}  setgdifull
{res}     8    0.000{txt}  setgdi
{res}          0.000{txt}  Total
connectstyle
{res}     7    0.000{txt}  _unabbrev
yxview
{res}     0    0.000{txt}  _fr_runlog
{res}     5    0.000{txt}  new
{res}     5    0.000{txt}  set
{res}     5    0.000{txt}  ranges
{res}    15    0.000{txt}  dimtitle
{res}     6    0.000{txt}  dimformat
{res}     5    0.001{txt}  newkey
{res}     5    0.000{txt}  label
{res}    24    0.000{txt}  dim_value_label_series
{res}     5    0.000{txt}  draw
{res}     4    0.000{txt}  yxview_connected_draw
{res}     5    0.016{txt}  _draw_line
{res}     4    0.053{txt}  _draw_points
{res}     1    0.000{txt}  yxview_line_draw
{res}          0.070{txt}  Total
xyaddviews
{res}     1    0.000{txt}  new
yxbartype_g
{res}     1    0.000{txt}  _unabbrev
labelstyle
{res}     6    0.000{txt}  new
{res}     6    0.000{txt}  set
{res}          0.000{txt}  Total
tickset_g
{res}     8    0.000{txt}  set_format
{res}     8    0.000{txt}  set_scale
{res}    12    0.000{txt}  set_ticks
{res}    26    0.000{txt}  overallmin
{res}    26    0.000{txt}  overallmax
{res}     4    0.000{txt}  suggest_between_ticks
{res}     2    0.000{txt}  clear
{res}     2    0.000{txt}  clear_ticks
{res}     2    0.000{txt}  range_ticks
{res}     2    0.000{txt}  _clear_rule_ticks
{res}     8    0.000{txt}  _tick_and_label_width
{res}     2    0.000{txt}  _has_customs
{res}     2    0.000{txt}  _max_multi_height
{res}    16    0.000{txt}  draw
{res}    16    0.000{txt}  _init_dlg_ticks
{res}    16    0.000{txt}  _compute_zs
{res}    20    0.000{txt}  on_a_specified
{res}    20    0.000{txt}  _set_dlg_tick
{res}          0.000{txt}  Total
_fr_legend_parse_and_log
{res}     1    0.000{txt}  _fr_legend_parse_and_log
{res}     1    0.000{txt}  ParseLogOpts
{res}     1    0.000{txt}  ParseLogLabel
{res}          0.000{txt}  Total
legendstyle
{res}     0    0.000{txt}  _fr_legend_parse_and_log
{res}     0    0.000{txt}  _declare_view
{res}          0.000{txt}  Total
legend_g
{res}     0    0.000{txt}  _fr_legend_parse_and_log
{res}     2    0.000{txt}  new
{res}     1    0.000{txt}  parse_and_log_titles
{res}     0    0.000{txt}  _declare_view
{res}     1    0.018{txt}  rebuild
{res}     1    0.000{txt}  clear
{res}     5    0.000{txt}  addkey
{res}     1    0.000{txt}  repositionkeys
{res}     1    0.000{txt}  PlaceKeyTextAdjRow
{res}     1    0.000{txt}  _try_align
{res}     1    0.000{txt}  distribute_styles
{res}     3    0.000{txt}  ysize
{res}     3    0.000{txt}  xsize
{res}     1    0.000{txt}  draw
{res}     1    0.000{txt}  _super_draw
{res}          0.018{txt}  Total
spacer
{res}    10    0.000{txt}  new
{res}    13    0.000{txt}  set
{res}    14    0.000{txt}  draw
{res}          0.000{txt}  Total
_fr_tbstyle_parse_and_log
{res}     1    0.000{txt}  _fr_tbstyle_parse_and_log
_fr_title_parse_and_log
{res}    16    0.021{txt}  _fr_title_parse_and_log
{res}     8    0.000{txt}  PosMap
{res}          0.021{txt}  Total
yxkey_g
{res}     0    0.000{txt}  newkey
{res}     5    0.000{txt}  new
{res}    15    0.000{txt}  is_scatter
{res}     5    0.000{txt}  set
{res}    60    0.000{txt}  extent
{res}     5    0.000{txt}  draw
{res}     5    0.000{txt}  xsize
{res}     5    0.000{txt}  ysize
{res}     5    0.000{txt}  realdraw
{res}     4    0.000{txt}  draw_connected
{res}     5    0.016{txt}  draw_line
{res}     9    0.000{txt}  _sym_y
{res}     4    0.000{txt}  draw_symbol
{res}          0.016{txt}  Total
gsize
{res}   508    0.032{txt}  gmval
_gs_parse_and_log_tickset
{res}     2    0.000{txt}  _gs_parse_and_log_tickset
{res}     2    0.000{txt}  Rules
{res}     2    0.000{txt}  NumTextList
{res}     2    0.000{txt}  Options
{res}          0.000{txt}  Total
_gs_parse_and_log_axtitle
{res}     2    0.000{txt}  _gs_parse_and_log_axtitle
_fr_merged_implicit
{res}     1    0.000{txt}  _fr_merged_implicit
_date2elapsed
{res}     2    0.000{txt}  _date2elapsed
object
{res}     1    0.000{txt}  popifendsin
colormult_nw
{res}     3    0.015{txt}  colormult_nw
view
{res}   262    0.002{txt}  extent
relative_posn
{res}     4    0.000{txt}  parallel_dim
gditransform
{res}     6    0.000{txt}  rescale
line_g
{res}     2    0.000{txt}  new
_gs_addgrname
{res}     1    0.000{txt}  _gs_addgrname
_gm_undo
{res}     1    0.000{txt}  UndoTitle
{res}     1    0.000{txt}  RedoTitle
{res}          0.000{txt}  Total
Overall total count = {res} 17626
{txt}Overall total time  = {res}    90.173{txt} (sec)
{com}.         {c )-}  
{txt}
{com}. graph export "$plot\ROC_curve_insample.png", replace    width(1500)
{txt}(file C:\Users\chasi_000\Dropbox\Apps\ShareLaTeX\Donde\Figuras\Boost\ROC_curve_insample.png written in PNG format)

{com}. 
. capture profiler clear
{txt}
{com}. profiler on
{txt}
{com}.         *Out of sample
. roccomp $dep_var logit_pred swlogit_pred krls_pred boost_pred if insample==0 , graph summary ///
>         legend(label(1 "Logit") label(2 "SW Logit") label(3 "KRLS") ///
>                 label(4 "Boosting") label(5 "Reference"))  graphregion(color(white))
{res}
{txt}{col 31}ROC{col 54}{c -}Asymptotic Normal{hline 2}
{col 17}   Obs       Area     Std. Err.      [95% Conf. Interval]
{hline 73}
{res}logit_pred         845     0.7402       0.0257        0.68990     0.79047
swlogit_pred       845     0.5596       0.0337        0.49350     0.62576
krls_pred          845     0.7187       0.0266        0.66660     0.77078
boost_pred         845     0.7947       0.0226        0.75037     0.83910
{txt}{hline 73}
Ho: area({res}logit_pred{txt}) = area({res}swlogit_pred{txt}) = area({res}krls_pred{txt}) = area({res}boost_pred{txt})
    chi2({res}3{txt}) = {res}   43.09{txt}       Prob>chi2 = {res}  0.0000
{txt}
{com}. profiler off
{txt}
{com}. if $profiler ==1 {c -(} 
.         profiler report 
{txt}roccomp
{res}     1    0.000{txt}  roccomp
{res}     1    0.190{txt}  ROCcomp
{res}     4    3.324{txt}  COMparea
{res}     1    0.003{txt}  MYTEst
{res}          3.517{txt}  Total
_get_gropts
{res}    10    0.016{txt}  _get_gropts
_check4gropts
{res}    13    0.000{txt}  _check4gropts
unab
{res}     9    0.000{txt}  unab
label
{res}  2943    0.091{txt}  label
logistic
{res}     8    0.000{txt}  logistic
{res}     8    0.000{txt}  Estimate
{res}     8    0.000{txt}  Display
{res}          0.000{txt}  Total
_vce_parserun
{res}     8    0.000{txt}  _vce_parserun
{res}     8    0.000{txt}  MYRESULT
{res}          0.000{txt}  Total
_on_colon_parse
{res}     8    0.000{txt}  _on_colon_parse
logit
{res}    16    0.000{txt}  logit
logit_10
{res}    16    0.000{txt}  logit_10
{res}     8    0.000{txt}  Display
{res}          0.000{txt}  Total
lsens
{res}     4    0.000{txt}  lsens
lfit_p
{res}     8    0.000{txt}  lfit_p
predict
{res}    12    0.000{txt}  predict
logistic_p
{res}    12    0.000{txt}  logistic_p
logit_p
{res}    12    0.016{txt}  logit_p
_pred_se
{res}    12    0.000{txt}  _pred_se
opts_exclusive
{res}    12    0.000{txt}  opts_exclusive
lsens_x
{res}     8    0.016{txt}  lsens_x
roctab
{res}     4    0.066{txt}  roctab
{res}     4    0.000{txt}  MYLRoc
{res}     4    2.964{txt}  DeLongSE
{res}     4    0.004{txt}  MYDIspl
{res}          3.034{txt}  Total
egen
{res}    44    0.015{txt}  egen
findfile
{res}    49    0.047{txt}  findfile
_ggroup
{res}     4    0.911{txt}  _ggroup
_gsum
{res}    40    0.000{txt}  _gsum
_gtotal
{res}    40    0.079{txt}  _gtotal
append
{res}     3    0.016{txt}  append
merge
{res}     3    0.000{txt}  merge
merge_10
{res}     3    0.000{txt}  merge_10
graph
{res}     1    0.000{txt}  graph
{res}     1    0.038{txt}  Graph
{res}     1    0.000{txt}  MergeBy
{res}     1    0.000{txt}  _unab_do
{res}     1    0.000{txt}  SetFixedSize
{res}          0.038{txt}  Total
gr_setscheme
{res}     1    0.000{txt}  gr_setscheme
gr_current
{res}     1    0.000{txt}  gr_current
gs_stat
{res}     2    0.000{txt}  gs_stat
{res}     1    0.000{txt}  Query
{res}     2    0.000{txt}  Stat
{res}     1    0.000{txt}  Assert
{res}          0.000{txt}  Total
gr_drop
{res}     1    0.020{txt}  gr_drop
serset
{res}     6    0.018{txt}  destructor
{res}     5    0.037{txt}  new
{res}     5    0.000{txt}  set_labels
{res}     1    0.000{txt}  sort
{res}     6    0.005{txt}  set
{res}    10    0.000{txt}  seriesof
{res}          0.060{txt}  Total
global_g
{res}     2    0.000{txt}  current_graph_resync
{res}     2    0.000{txt}  set_current_graph
{res}     1    0.000{txt}  ResetEditor
{res}          0.000{txt}  Total
axisstyle
{res}     0    0.016{txt}  Graph
{res}     4    0.000{txt}  _unabbrev
{res}     1    0.000{txt}  new
{res}     4    0.000{txt}  extend
{res}          0.016{txt}  Total
style
{res}     0    0.032{txt}  new
{res}     0    0.000{txt}  Graph
{res}     0    0.016{txt}  edit
{res}     0    0.000{txt}  set
{res}     0    0.000{txt}  setstyle
{res}    66    0.032{txt}  editstyle
{res}    55    0.003{txt}  remake_as_copy
{res}     0    0.000{txt}  _declare_view
{res}     0    0.000{txt}  _fr_runlog
{res}     0    0.000{txt}  _set_orientation
{res}     0    0.000{txt}  set_true
{res}     0    0.000{txt}  set_false
{res}     0    0.000{txt}  _fr_legend_parse_and_log
{res}     0    0.000{txt}  newkey
{res}     5    0.001{txt}  Restyle
{res}     5    0.000{txt}  RestyleVal
{res}    70    0.001{txt}  _reset_attrib_val
{res}     0    0.000{txt}  real_draw
{res}          0.085{txt}  Total
scheme
{res}   289    0.050{txt}  style
{res}     1    0.000{txt}  new
{res}          0.050{txt}  Total
ticksetstyle
{res}    12    0.000{txt}  new
numstyle
{res}   128    0.000{txt}  new
{res}   128    0.032{txt}  set
{res}   143    0.031{txt}  setstyle
{res}    38    0.000{txt}  setting
{res}          0.063{txt}  Total
linestyle
{res}    25    0.000{txt}  new
{res}    25    0.000{txt}  set
{res}     3    0.015{txt}  blank_line
{res}    61    0.000{txt}  setgdi
{res}    34    0.000{txt}  setgdifull
{res}          0.015{txt}  Total
axis
{res}     0    0.016{txt}  Graph
{res}     3    0.000{txt}  new
{res}     3    0.017{txt}  set
{res}     3    0.000{txt}  set_formats
{res}     3    0.001{txt}  set_scales
{res}     5    0.001{txt}  set_ticks
{res}     6    0.000{txt}  reset_scale
{res}     6    0.000{txt}  overallmin
{res}     6    0.000{txt}  overallmax
{res}     1    0.000{txt}  ysize
{res}     1    0.000{txt}  ysize_notitle
{res}     2    0.000{txt}  _tick_and_label_width
{res}    24    0.016{txt}  _value_label_series
{res}     1    0.000{txt}  xsize
{res}     1    0.000{txt}  xsize_notitle
{res}     4    0.000{txt}  draw
{res}     4    0.001{txt}  real_draw
{res}     4    0.000{txt}  Selected
{res}     2    0.000{txt}  _declare_array
{res}     2    0.000{txt}  _draw_title
{res}          0.052{txt}  Total
yesno
{res}   109    0.015{txt}  _unabbrev
{res}    11    0.000{txt}  set_true
{res}    10    0.000{txt}  set_false
{res}     2    0.000{txt}  isfalse
{res}          0.015{txt}  Total
textbox
{res}     0    0.000{txt}  Graph
{res}    22    0.000{txt}  new
{res}    47    0.000{txt}  set
{res}    52    0.001{txt}  edit
{res}     5    0.000{txt}  _set_orientation
{res}     5    0.000{txt}  resetstyle
{res}   122    0.000{txt}  not_drawn
{res}    39    0.001{txt}  ysize
{res}    49    0.000{txt}  textheight
{res}     4    0.000{txt}  xsize
{res}     7    0.000{txt}  draw
{res}     7    0.000{txt}  _get_x_y_delta
{res}          0.002{txt}  Total
textboxstyle
{res}     9    0.000{txt}  new
{res}     9    0.000{txt}  set
{res}     7    0.000{txt}  setgdifull
{res}     7    0.000{txt}  setgdi
{res}          0.000{txt}  Total
tb_orientstyle
{res}     6    0.000{txt}  _unabbrev
anyview_g
{res}     0    0.000{txt}  Graph
{res}     9    0.000{txt}  new
{res}    26    0.000{txt}  set
{res}    12    0.000{txt}  setstyle
{res}    35    0.016{txt}  set_gdi_posn
{res}    70    0.001{txt}  gdi_yposn
{res}    70    0.015{txt}  gdi_xposn
{res}    15    0.016{txt}  compass_draw
{res}     7    0.000{txt}  set_gdi_posn_notrans
{res}          0.048{txt}  Total
stretchability
{res}     2    0.000{txt}  new
sized_textbox
{res}    22    0.000{txt}  new
{res}    47    0.001{txt}  set
{res}    40    0.001{txt}  ysize
{res}    40    0.000{txt}  xsize
{res}    37    0.000{txt}  textwidth
{res}    23    0.000{txt}  draw
{res}     7    0.000{txt}  _super_draw
{res}          0.002{txt}  Total
code
{res}   133    0.000{txt}  set
{res}     3    0.000{txt}  new
{res}     3    0.000{txt}  add
{res}   979    0.002{txt}  setting
{res}          0.002{txt}  Total
scale
{res}     0    0.000{txt}  Graph
{res}     3    0.000{txt}  new
{res}     3    0.000{txt}  set
{res}     2    0.000{txt}  reinit
{res}    10    0.000{txt}  addmin
{res}    10    0.000{txt}  addmax
{res}     2    0.000{txt}  add_axis
{res}     6    0.000{txt}  reset_from_axes
{res}     6    0.000{txt}  setgdi
{res}          0.000{txt}  Total
fixedcode
{res}     3    0.000{txt}  new
transform
{res}     0    0.000{txt}  Graph
{res}     7    0.000{txt}  new
{res}     7    0.000{txt}  set
{res}    17    0.000{txt}  get_from_gdi
{res}    99    0.000{txt}  translate
{res}   103    0.000{txt}  reset
{res}          0.000{txt}  Total
compass2dir
{res}    46    0.016{txt}  _unabbrev
{res}    10    0.000{txt}  isnorth
{res}    10    0.000{txt}  issouth
{res}     6    0.000{txt}  iseast
{res}     6    0.000{txt}  iswest
{res}          0.016{txt}  Total
twowaygraph_g
{res}     0    0.000{txt}  Graph
{res}     1    0.000{txt}  new
{res}     1    0.000{txt}  parse
{res}     1    0.000{txt}  SetCheckPlotregion
{res}     5    0.000{txt}  _unab_cmd
{res}     5    0.016{txt}  ParseOpts
{res}     1    0.000{txt}  create_axes
{res}     1    0.000{txt}  n_yaxes
{res}     1    0.000{txt}  n_xaxes
{res}          0.016{txt}  Total
graphstyle
{res}     0    0.000{txt}  Graph
gridringstyle
{res}    26    0.015{txt}  _unabbrev
plotregionstyle
{res}     4    0.000{txt}  new
{res}     5    0.000{txt}  set
{res}          0.000{txt}  Total
areastyle
{res}    11    0.000{txt}  set
{res}     5    0.000{txt}  new
{res}     8    0.000{txt}  is_drawn
{res}     3    0.000{txt}  draw
{res}     3    0.000{txt}  patterned_line
{res}     3    0.000{txt}  setgdifull
{res}     3    0.000{txt}  setgdi
{res}          0.000{txt}  Total
graph_g
{res}     0    0.000{txt}  Graph
{res}     1    0.000{txt}  new
{res}     1    0.000{txt}  ParseAndLogAxes
{res}     4    0.000{txt}  _axisnum
{res}     1    0.000{txt}  parse_and_log_titles
{res}     1    0.000{txt}  parse_and_log_spacers
{res}     1    0.117{txt}  drawgraph
{res}     1    0.000{txt}  draw
{res}     1    0.000{txt}  _use_aspect_ratio
{res}     1    0.000{txt}  _has_spacers
{res}     1    0.001{txt}  record_header
{res}     1    0.000{txt}  ClearEditor
{res}     1    0.000{txt}  SetUndoRedoMenus
{res}          0.118{txt}  Total
stretch_g
{res}     2    0.000{txt}  new
grid
{res}     0    0.000{txt}  Graph
{res}     5    0.015{txt}  new
{res}    46    0.033{txt}  insert
{res}    46    0.001{txt}  _set_direction
{res}    46    0.033{txt}  _add_view
{res}    46    0.032{txt}  _declare_view
{res}     7    0.016{txt}  _find_ringcol
{res}    16    0.017{txt}  _find_ringrow
{res}     3    0.000{txt}  list_ofclass
{res}     3    0.000{txt}  draw_setup1
{res}     3    0.000{txt}  _set_rensize
{res}     3    0.000{txt}  draw_setup2
{res}     6    0.000{txt}  _align
{res}     3    0.000{txt}  position
{res}     6    0.015{txt}  _pos_dim
{res}    90    0.016{txt}  _update_pos
{res}     8    0.000{txt}  ysize
{res}    16    0.002{txt}  _fixed_sz
{res}   230    0.050{txt}  _do_fixed
{res}   230    0.016{txt}  _adj_span
{res}     6    0.000{txt}  _set_sizes
{res}     6    0.000{txt}  _sum_fixed
{res}     6    0.000{txt}  _posn_from_size
{res}     8    0.000{txt}  xsize
{res}     1    0.000{txt}  list_ofclass_indices
{res}     1    0.000{txt}  draw_cell
{res}    46    0.015{txt}  _draw_cell
{res}     3    0.015{txt}  draw_cells
{res}     2    0.000{txt}  draw
{res}     1    0.000{txt}  _shr_only_ct
{res}          0.276{txt}  Total
margin
{res}    44    0.000{txt}  new
{res}    44    0.015{txt}  set
{res}    46    0.000{txt}  setstyle
{res}    15    0.001{txt}  setgdi
{res}    82    0.000{txt}  gmleft
{res}    82    0.000{txt}  gmbottom
{res}    73    0.000{txt}  gmright
{res}    73    0.016{txt}  gmtop
{res}     3    0.000{txt}  set2gm
{res}          0.032{txt}  Total
container
{res}     0    0.000{txt}  Graph
{res}     5    0.000{txt}  new
{res}     2    0.000{txt}  set_gu_scaling
{res}     3    0.000{txt}  get_gu_scaling
{res}     3    0.000{txt}  reset_gu_scaling
{res}          0.000{txt}  Total
color
{res}    43    0.000{txt}  new
{res}     6    0.000{txt}  set
{res}    49    0.016{txt}  setstyle
{res}    49    0.000{txt}  _unabbrev
{res}     3    0.000{txt}  setting
{res}     3    0.000{txt}  setintensity100
{res}     3    0.000{txt}  setintensity
{res}    95    0.001{txt}  setgdi
{res}     3    0.000{txt}  setrgb
{res}          0.017{txt}  Total
_fr_area_parse_and_log
{res}     3    0.000{txt}  _fr_area_parse_and_log
{res}     1    0.000{txt}  _fr_area_parse_and_log_once
{res}          0.000{txt}  Total
cutil
{res}     5    0.000{txt}  cutil
classutil
{res}     5    0.000{txt}  classutil
{res}     5    0.000{txt}  Which
{res}     5    0.000{txt}  GetClassName
{res}          0.000{txt}  Total
twoway_yxview_parse
{res}     5    0.000{txt}  parse
{res}    15    0.000{txt}  BarOrBarDerived
{res}     5    0.000{txt}  parse_opts
{res}     5    0.015{txt}  factor
{res}     5    0.016{txt}  FactorPlot
{res}     1    0.000{txt}  log_touse
{res}     5    0.000{txt}  log_create_view
{res}     5    0.000{txt}  _type_suffix
{res}     5    0.000{txt}  log_edits
{res}          0.031{txt}  Total
twoway_function_parse
{res}     1    0.000{txt}  new
{res}     1    0.000{txt}  parse
{res}     1    0.000{txt}  log_create_serset
{res}     1    0.000{txt}  log_edits
{res}          0.000{txt}  Total
twoway__function_gen
{res}     2    0.000{txt}  twoway__function_gen
{res}     2    0.000{txt}  CheckGenOpt
{res}     1    0.000{txt}  GenData
{res}          0.000{txt}  Total
_fr_runlog
{res}     4    0.016{txt}  _fr_runlog
clockdir
{res}    10    0.000{txt}  _unabbrev
{res}     9    0.000{txt}  relative_position
{res}     9    0.000{txt}  iseast
{res}     9    0.000{txt}  iswest
{res}     9    0.000{txt}  issouth
{res}     9    0.000{txt}  compass2style
{res}     8    0.000{txt}  horizontal_style
{res}     4    0.000{txt}  isnorth
{res}          0.000{txt}  Total
shadestyle
{res}     2    0.000{txt}  new
{res}     2    0.000{txt}  set
{res}     3    0.000{txt}  setgdi
{res}          0.000{txt}  Total
linewidth
{res}     3    0.000{txt}  new
linepattern
{res}     3    0.000{txt}  new
{res}     3    0.000{txt}  set
{res}     3    0.000{txt}  setstyle
{res}    61    0.000{txt}  setgdi
{res}          0.000{txt}  Total
series
{res}    10    0.000{txt}  new
{res}    10    0.000{txt}  set_labels
{res}    15    0.000{txt}  label_or_name
{res}          0.000{txt}  Total
plotregion
{res}     0    0.000{txt}  _declare_view
{res}     1    0.000{txt}  new
{res}     1    0.000{txt}  set
{res}     1    0.000{txt}  clear_scales
{res}     1    0.000{txt}  reset_scales
{res}     5    0.000{txt}  _set_scales
{res}     2    0.000{txt}  dimtitle_mquoted
{res}     2    0.000{txt}  dimtitle
{res}     4    0.000{txt}  addaxis
{res}     6    0.000{txt}  dimformat
{res}     1    0.000{txt}  list_ofclass
{res}     2    0.000{txt}  draw
{res}     2    0.000{txt}  xsize
{res}     2    0.000{txt}  ysize
{res}     2    0.000{txt}  _sized_draw
{res}     2    0.001{txt}  real_draw
{res}          0.001{txt}  Total
cell
{res}    46    0.016{txt}  _prse_set_span
{res}    92    0.016{txt}  _set_span
{res}          0.032{txt}  Total
yxtype
{res}     7    0.000{txt}  _unabbrev
connectstyle
{res}     2    0.000{txt}  _unabbrev
yxview
{res}     0    0.000{txt}  _fr_runlog
{res}     5    0.000{txt}  new
{res}     5    0.000{txt}  set
{res}     5    0.000{txt}  ranges
{res}    15    0.000{txt}  dimtitle
{res}     6    0.000{txt}  dimformat
{res}     5    0.000{txt}  newkey
{res}     5    0.000{txt}  label
{res}    24    0.000{txt}  dim_value_label_series
{res}     5    0.000{txt}  draw
{res}     4    0.000{txt}  yxview_connected_draw
{res}     5    0.015{txt}  _draw_line
{res}     4    0.032{txt}  _draw_points
{res}     1    0.000{txt}  yxview_line_draw
{res}          0.047{txt}  Total
xyaddviews
{res}     1    0.000{txt}  new
yxbartype_g
{res}     1    0.000{txt}  _unabbrev
markerstyle
{res}     2    0.000{txt}  new
{res}     4    0.000{txt}  drawn
{res}     8    0.000{txt}  setgdifull
{res}     8    0.000{txt}  setgdi
{res}          0.000{txt}  Total
labelstyle
{res}     1    0.000{txt}  new
{res}     1    0.000{txt}  set
{res}          0.000{txt}  Total
anglestyle
{res}    19    0.000{txt}  new
{res}    48    0.000{txt}  _unabbrev
{res}          0.000{txt}  Total
tickset_g
{res}     8    0.000{txt}  set_format
{res}     8    0.000{txt}  set_scale
{res}    12    0.001{txt}  set_ticks
{res}    26    0.001{txt}  overallmin
{res}    26    0.000{txt}  overallmax
{res}     4    0.000{txt}  suggest_between_ticks
{res}     2    0.000{txt}  clear
{res}     2    0.000{txt}  clear_ticks
{res}     2    0.000{txt}  range_ticks
{res}     2    0.000{txt}  _clear_rule_ticks
{res}     8    0.000{txt}  _tick_and_label_width
{res}     2    0.000{txt}  _has_customs
{res}     2    0.000{txt}  _max_multi_height
{res}    16    0.048{txt}  draw
{res}    16    0.000{txt}  _init_dlg_ticks
{res}    16    0.000{txt}  _compute_zs
{res}    20    0.001{txt}  on_a_specified
{res}    20    0.000{txt}  _set_dlg_tick
{res}          0.051{txt}  Total
_fr_legend_parse_and_log
{res}     1    0.000{txt}  _fr_legend_parse_and_log
{res}     1    0.000{txt}  ParseLogOpts
{res}     1    0.000{txt}  ParseLogLabel
{res}          0.000{txt}  Total
legendstyle
{res}     0    0.000{txt}  _fr_legend_parse_and_log
{res}     0    0.000{txt}  _declare_view
{res}          0.000{txt}  Total
legend_g
{res}     0    0.000{txt}  _fr_legend_parse_and_log
{res}     2    0.000{txt}  new
{res}     1    0.000{txt}  parse_and_log_titles
{res}     0    0.000{txt}  _declare_view
{res}     1    0.000{txt}  rebuild
{res}     1    0.000{txt}  clear
{res}     5    0.000{txt}  addkey
{res}     1    0.000{txt}  repositionkeys
{res}     1    0.000{txt}  PlaceKeyTextAdjRow
{res}     1    0.000{txt}  _try_align
{res}     1    0.000{txt}  distribute_styles
{res}     3    0.000{txt}  ysize
{res}     3    0.000{txt}  xsize
{res}     1    0.000{txt}  draw
{res}     1    0.000{txt}  _super_draw
{res}          0.000{txt}  Total
spacer
{res}    10    0.000{txt}  new
{res}    13    0.000{txt}  set
{res}    14    0.000{txt}  draw
{res}          0.000{txt}  Total
_fr_tbstyle_parse_and_log
{res}     1    0.000{txt}  _fr_tbstyle_parse_and_log
_fr_title_parse_and_log
{res}    16    0.016{txt}  _fr_title_parse_and_log
{res}     8    0.000{txt}  PosMap
{res}          0.016{txt}  Total
yxkey_g
{res}     0    0.000{txt}  newkey
{res}     5    0.000{txt}  new
{res}    15    0.000{txt}  is_scatter
{res}     5    0.000{txt}  set
{res}    60    0.000{txt}  extent
{res}     5    0.000{txt}  draw
{res}     5    0.016{txt}  xsize
{res}     5    0.000{txt}  ysize
{res}     5    0.000{txt}  realdraw
{res}     4    0.000{txt}  draw_connected
{res}     5    0.000{txt}  draw_line
{res}     9    0.000{txt}  _sym_y
{res}     4    0.000{txt}  draw_symbol
{res}          0.016{txt}  Total
gsize
{res}   508    0.000{txt}  gmval
_gs_parse_and_log_tickset
{res}     2    0.000{txt}  _gs_parse_and_log_tickset
{res}     2    0.000{txt}  Rules
{res}     2    0.000{txt}  NumTextList
{res}     2    0.000{txt}  Options
{res}          0.000{txt}  Total
_gs_parse_and_log_axtitle
{res}     2    0.000{txt}  _gs_parse_and_log_axtitle
_fr_merged_implicit
{res}     1    0.000{txt}  _fr_merged_implicit
_date2elapsed
{res}     2    0.000{txt}  _date2elapsed
object
{res}     1    0.000{txt}  popifendsin
colormult_nw
{res}     3    0.000{txt}  colormult_nw
view
{res}   262    0.016{txt}  extent
tickstyle
{res}     2    0.000{txt}  size
{res}    16    0.001{txt}  setgdifull
{res}    16    0.000{txt}  setgdi
{res}    32    0.000{txt}  tick_length
{res}          0.001{txt}  Total
relative_posn
{res}     4    0.000{txt}  parallel_dim
gditransform
{res}     6    0.000{txt}  rescale
textstyle
{res}    16    0.000{txt}  setgdi
line_g
{res}     2    0.000{txt}  new
_gs_addgrname
{res}     1    0.000{txt}  _gs_addgrname
_gm_undo
{res}     1    0.000{txt}  UndoTitle
{res}     1    0.001{txt}  RedoTitle
{res}          0.001{txt}  Total
Overall total count = {res} 10696
{txt}Overall total time  = {res}     8.944{txt} (sec)
{com}.         {c )-}  
{txt}
{com}. graph export "$plot\ROC_curve_outsample.png", replace   width(1500)
{txt}(file C:\Users\chasi_000\Dropbox\Apps\ShareLaTeX\Donde\Figuras\Boost\ROC_curve_outsample.png written in PNG format)

{com}. restore
{txt}
{com}. ********************************************************************************
. 
. 
. 
. save "$computer_path\DB\boost.dta", replace
{txt}file C:\Users\chasi_000\Dropbox\Apps\ShareLaTeX\Donde\DB\boost.dta saved

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\chasi_000\Dropbox\Apps\ShareLaTeX\Donde\log\Boosting20 Apr 2017.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}21 Apr 2017, 10:46:13
{txt}{.-}
{smcl}
{txt}{sf}{ul off}